{
  "timestamp": "2017-01-13T00:59:12.976Z",
  "collections": [
    {
      "name": "AcademicYearInstanceCollection",
      "contents": [
        {
          "student": "abi",
          "year": 2015
        },
        {
          "student": "abi",
          "year": 2016
        },
        {
          "student": "abi",
          "year": 2017
        },
        {
          "student": "abi",
          "year": 2018
        },
        {
          "student": "alfred",
          "year": 2016
        },
        {
          "student": "alfred",
          "year": 2015
        },
        {
          "student": "betty",
          "year": 2016
        },
        {
          "student": "betty",
          "year": 2015
        },
        {
          "student": "betty",
          "year": 2014
        },
        {
          "student": "betty",
          "year": 2012
        },
        {
          "student": "betty",
          "year": 2011
        },
        {
          "student": "betty",
          "year": 2010
        },
        {
          "student": "betty",
          "year": 2009
        },
        {
          "student": "charley",
          "year": 2016
        },
        {
          "student": "charley",
          "year": 2017
        },
        {
          "student": "charley",
          "year": 2018
        },
        {
          "student": "charley",
          "year": 2019
        }
      ]
    },
    {
      "name": "AdvisorLogCollection",
      "contents": []
    },
    {
      "name": "CareerGoalCollection",
      "contents": [
        {
          "name": "Database Administrator",
          "slug": "database-administrator",
          "interests": [
            "application-development",
            "software-engineering",
            "databases"
          ],
          "description": "Companies, private organizations, and government agencies rely on database administrators (DBAs) to organize and monitor financial records, employee profiles, and other sensitive information. These professionals also work to improve security and efficiency through testing, regular evaluation, and routine modifications. Evolving technologies and an increased demand for secure electronic recordkeeping are expected to drive employment growth in this sector.  DBAs may be employed in-house at larger firms or organizations, but an increasing number of these professionals are finding work at third-party companies that specialize in database services. Salary range (according to GlassDoor): $48,000 - $101,000.",
          "moreInformation": "http://www.bls.gov/ooh/computer-and-information-technology/database-administrators.htm"
        },
        {
          "name": "Data Scientist",
          "slug": "data-scientist",
          "interests": [
            "graduate-school",
            "software-engineering",
            "databases",
            "machine-learning",
            "algorithms",
            "data-science"
          ],
          "description": "Data scientists are high-ranking professionals with the training and curiosity to make discoveries in the world of big data. LinkedIn uses data scientists to generate ideas for products, features, and value-adding services. At Intuit, data scientists are asked to develop insights for small-business customers and consumers and report to a new senior vice president of big data, social design, and marketing. GE uses data scientists to optimize the service contracts and maintenance intervals for industrial products. Googleuses data scientists to refine its core search and ad-serving algorithms. Zynga uses data scientists to optimize the game experience for both long-term engagement and revenue. Netflix created the well-known Netflix Prize, given to the data science team that developed the best way to improve the company’s movie recommendation system. The test-preparation firm Kaplan uses its data scientists to uncover effective learning strategies. Salary range (according to GlassDoor): $95,000 - $133,000.",
          "moreInformation": "https://hbr.org/2012/10/data-scientist-the-sexiest-job-of-the-21st-century/"
        },
        {
          "name": "Information Security Analyst",
          "slug": "information-security-analyst",
          "interests": [
            "security"
          ],
          "description": "Information security analysts protect the computers and online networks of private companies, organizations, and government agencies. They primarily monitor information systems for suspicious activity and use different programs — such as firewalls and encryption software — to maintain security. Analysts may also develop information security plans and work with company leaders to increase system efficiency. Salary range (according to GlassDoor): $59,000 - $109,000.",
          "moreInformation": "http://www.bls.gov/ooh/computer-and-information-technology/information-security-analysts.htm"
        },
        {
          "name": "Information System Manager",
          "slug": "information-system-manager",
          "interests": [
            "application-development",
            "it-management",
            "graduate-school"
          ],
          "description": "Information systems managers (including Chief Information Officers, Chief Technology Officers, and IT Directors) plan, coordinate, and direct computer-related activities in an organization. Chief Information Officers (CIOs) are responsible for the overall technology strategy of their organizations. Chief Technology Officers (CTOs) evaluate new technology and determine how it can help their organization. IT Directors, including management information systems (MIS) directors, are in charge of their organizations’ information technology departments, and they directly supervise other employees. Successful applicants often combine a technical undergraduate degree in computer science or engineering with a graduate degree (Masters of Business Administration). Salary range (according to GlassDoor): $97,000 - $166,000.",
          "moreInformation": "http://www.bls.gov/ooh/management/computer-and-information-systems-managers.htm"
        },
        {
          "name": "Network Engineer",
          "slug": "network-architect",
          "interests": [
            "networks",
            "hardware"
          ],
          "description": "Network architects design and build data communication networks, including local area networks (LANs), wide area networks (WANs), and intranets. These networks range from small connections between two offices to next-generation networking capabilities such as a cloud infrastructure that serves multiple customers. Network architects must have extensive knowledge of an organization’s structure and processes to design a network that can help the organization achieve its goals. Salary range according to GlassDoor: $58,000 - $125,000.",
          "moreInformation": "http://www.bls.gov/ooh/computer-and-information-technology/computer-network-architects.htm"
        },
        {
          "name": "Research Scientist",
          "slug": "research-scientist",
          "interests": [
            "graduate-school"
          ],
          "description": "Research scientists invent and design new approaches to computing technology and find innovative uses for existing technology. They study and solve complex problems in computing for business, medicine, science, and other fields. Most jobs for research scientists require a graduate degree in computer science or a related field. Salary range (according to GlassDoor): $115,000 - $168,000.",
          "moreInformation": "http://www.bls.gov/ooh/computer-and-information-technology/computer-and-information-research-scientists.htm"
        },
        {
          "name": "Software Developer",
          "slug": "software-developer",
          "interests": [
            "application-development",
            "software-engineering",
            "databases"
          ],
          "description": "Software developers are responsible for designing computing programs, apps, and support systems. They meet with clients to discuss technological needs, and then develop software that addresses these demands. Once complete, developer specs and instructions are used as a reference point during the programming/coding process. With more than 1.1 million working professionals, software development represents one of the largest fields in computer science. Salary range (according to GlassDoor): $55,000 - $118,000.",
          "moreInformation": "http://www.bls.gov/ooh/computer-and-information-technology/software-developers.htm"
        },
        {
          "name": "System Administrator",
          "slug": "system-administrator",
          "interests": [
            "networks"
          ],
          "description": "System administrators manage an organization’s servers and desktop and mobile equipment. They ensure that email and data storage networks work properly. They also make sure that employee workstations are working efficiently and stay connected to the network. Some administrators manage telecommunication networks, or help network architects design and analyze network models. They also participate in decisions about buying future hardware or software to upgrade their organization’s network. Some administrators provide technical support to computer users, and they also may supervise computer support specialists who help solve users’ problems. Salary range (according to GlassDoor): $54,000 - $98,000.",
          "moreInformation": "http://www.bls.gov/ooh/computer-and-information-technology/computer-network-architects.htm"
        },
        {
          "name": "Web Developer",
          "slug": "web-developer",
          "interests": [
            "application-development",
            "software-engineering"
          ],
          "description": "Web developers design and create websites. They are responsible for the look of the site, its performance, and its capacity. In addition, web developers may create content for the site. Web developers often work on a team, and may specialize in a certain area of web development, including site layout or graphics integration. About 1 in 7 of web developers were self-employed in 2014. Many web developers have only an associates degree. Salary range (according to GlassDoor): $54,000 - $84,000.",
          "moreInformation": "http://www.bls.gov/ooh/computer-and-information-technology/web-developers.htm"
        }
      ]
    },
    {
      "name": "CourseCollection",
      "contents": [
        {
          "name": "Non Computer Science Course",
          "shortName": "Non-CS Course",
          "slug": "other",
          "number": "other",
          "description": "The course used to represent all non-CS courses.",
          "creditHrs": 3,
          "interests": [],
          "prerequisites": []
        },
        {
          "name": "Digital Tools for the Information World",
          "shortName": "Digital Tools",
          "slug": "ics101",
          "number": "ICS 101",
          "description": "Fundamental information technology concepts and computing terminology, productivity software for problem solving, computer technology trends and impact on individuals and society. Emphasizes the utilization of operating systems and the production of professional documents, spreadsheets, etc.",
          "creditHrs": 4,
          "interests": [],
          "prerequisites": []
        },
        {
          "name": "Introduction to Computer Programming",
          "shortName": "Intro to CS",
          "slug": "ics110",
          "number": "ICS 110",
          "description": "Basic concepts needed to write computer programs. Simple program design and implementation using a specific programming language; (C) C; (D) through animations; (P) Python. Each alpha repeatable unlimited times, but credit earned one time only.",
          "creditHrs": 3,
          "interests": [],
          "prerequisites": []
        },
        {
          "name": "Introduction to Computer Science I",
          "shortName": "Comp Sci I",
          "slug": "ics111",
          "number": "ICS 111",
          "description": "Overview of computer science, including Java programming, control structures, subroutines, objects and classes, GUI programming, arrays, and recursion.",
          "creditHrs": 4,
          "interests": [
            "java"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS111.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS111/",
          "prerequisites": []
        },
        {
          "name": "Discrete Mathematics for Computer Science I",
          "shortName": "Discrete Math I",
          "slug": "ics141",
          "number": "ICS 141",
          "description": "Introduction to propositional and predicate logic, sets, functions, linear algebra, algorithms, mathematical reasoning, recursion, counting techniques, and probability theory.",
          "creditHrs": 3,
          "interests": [
            "algorithms"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS141.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS141/",
          "prerequisites": []
        },
        {
          "name": "Introduction to Computer Science II",
          "shortName": "Comp Sci II",
          "slug": "ics211",
          "number": "ICS 211",
          "description": "Object-oriented programming, algorithms and their complexity, introduction to software engineering, lists, stacks, queues, trees hash tables, and searching and sorting algorithms.",
          "creditHrs": 4,
          "interests": [
            "algorithms",
            "software-engineering",
            "java"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS211.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS211/",
          "prerequisites": [
            "ics111"
          ]
        },
        {
          "name": "Program Structure",
          "shortName": "Program Structure",
          "slug": "ics212",
          "number": "ICS 212",
          "description": "Program organization paradigms, programming environments, implementation of a module from specifications, the C and C++ programming languages.",
          "creditHrs": 3,
          "interests": [
            "c",
            "cplusplus",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS212.html",
          "prerequisites": [
            "ics211"
          ]
        },
        {
          "name": "Introduction to Scripting",
          "shortName": "Scripting",
          "slug": "ics215",
          "number": "ICS 215",
          "description": "Introduction to scripting languages for the integration of applications and systems. Scripting in operating systems, web pages, server-side application integration, regular expressions, event handling, input validation, selection, repetition, parameter passing, Perl, JavaScript, and PHP.",
          "creditHrs": 3,
          "interests": [
            "perl",
            "javascript",
            "ruby",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS215.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS215/",
          "prerequisites": [
            "ics211"
          ]
        },
        {
          "name": "Basic Concepts of Computer Science",
          "shortName": "Comp Sci Concepts",
          "slug": "ics222",
          "number": "ICS 222",
          "description": "What is computer science about? What is the difference between computers and other machines? What are the limits of computation? Are there computers that are not machines? Understand the basic issues of computability, complexity, and network effects, and learn to apply them in the practice of computation.",
          "creditHrs": 3,
          "interests": [
            "theory-of-computation"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS222.html",
          "prerequisites": [
            "ics141"
          ]
        },
        {
          "name": "Discrete Mathematics for Computer Science II",
          "shortName": "Discrete Math II",
          "slug": "ics241",
          "number": "ICS 241",
          "description": "Program correctness, recurrence relations and their solutions, divide and conquer relations, relations and their properties, graph theory, trees and their applications, Boolean algebra, introduction to formal languages and automata theory.",
          "creditHrs": 3,
          "interests": [
            "algorithms"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS241.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS241/",
          "prerequisites": [
            "ics141"
          ]
        },
        {
          "name": "Algorithms",
          "shortName": "Algorithms",
          "slug": "ics311",
          "number": "ICS 311",
          "description": "Design and correctness of algorithms, including divide-and-conquer, greedy and dynamic programming methods. Complexity analyses using recurrence relations, probabilistic methods, and NP-completeness. Applications to order statistics, disjoint sets, B-trees and balanced trees, graphs, network flows, and string matching.",
          "creditHrs": 4,
          "interests": [
            "algorithms",
            "data-science"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS311.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS311/",
          "prerequisites": [
            "ics241",
            "ics211"
          ]
        },
        {
          "name": "Software Engineering I",
          "shortName": "Software Eng I",
          "slug": "ics314",
          "number": "ICS 314",
          "description": "Problem analysis and design, team-oriented development, quality assurance, configuration management, project planning.",
          "creditHrs": 3,
          "interests": [
            "software-engineering",
            "javascript",
            "application-development",
            "it-management"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS314.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS314/",
          "prerequisites": [
            "ics211",
            "ics241"
          ]
        },
        {
          "name": "Machine-Level and Systems Programming",
          "shortName": "Systems Programming",
          "slug": "ics312",
          "number": "ICS 312",
          "description": "Machine organization, machine instructions, addressing modes, assembler language, subroutine linkage, linking to higher-level languages, interface to operating systems, introduction to assemblers, loaders and compilers.",
          "creditHrs": 3,
          "interests": [
            "assembler",
            "computer-architecture",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS311.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS311/",
          "prerequisites": [
            "ics212",
            "ics314"
          ]
        },
        {
          "name": "Programming Language Theory",
          "shortName": "Programming Languages",
          "slug": "ics313",
          "number": "ICS 313",
          "description": "Syntax, semantics, control structures, variable binding and scopes, data and control abstractions. Programming in functional (LISP) and logic (Prolog) programming styles.",
          "creditHrs": 3,
          "interests": [
            "lisp",
            "prolog"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS313.html",
          "prerequisites": [
            "ics212",
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Data Storage and Retrieval",
          "shortName": "Databases I",
          "slug": "ics321",
          "number": "ICS 321",
          "description": "Data storage devices, timing and capacity, programming for files, hashed and indexed files, introduction to relational database systems.",
          "creditHrs": 3,
          "interests": [
            "databases",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS321.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS321/",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Logic Design and Microprocessors",
          "shortName": "Microprocessors",
          "slug": "ics331",
          "number": "ICS 331",
          "description": "Basic machine architecture, microprocessors, bus organization, circuit elements, logic circuit analysis and design, microcomputer system design.",
          "creditHrs": 4,
          "interests": [
            "computer-architecture",
            "hardware",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS331.html",
          "prerequisites": [
            "ics212",
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Operating Systems",
          "shortName": "Operating Systems",
          "slug": "ics332",
          "number": "ICS 332",
          "description": "Operating system concepts and structure, processes and threads, CPU scheduling, memory management, scheduling, file systems, inter-process communication, virtualization, popular operating systems.",
          "creditHrs": 3,
          "interests": [
            "operating-systems",
            "computer-architecture",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS332.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Network Design and Management",
          "shortName": "Networks",
          "slug": "ics351",
          "number": "ICS 351",
          "description": "Overview of the internet and its capabilities; introduction to HTTP, TCP/IP, ethernet, and wireless 802.11; routers, switches, and NAT; network and wireless security; practical experience in designing and implementing networks.",
          "creditHrs": 3,
          "interests": [
            "networks",
            "security",
            "hardware",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS331.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Security and Trust I: Resource Protections",
          "shortName": "Security & Trust I",
          "slug": "ics355",
          "number": "ICS 355",
          "description": "Security and trust in computers, networks, and society. Security models. Access and authorization. Availability and Denial-of-Service. Trust processes and network interactions.",
          "creditHrs": 3,
          "interests": [
            "security"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS355.html",
          "moreInformation": "http://courses.ics.hawaii.edu/ReviewICS355/",
          "prerequisites": [
            "ics222",
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Introduction to Artificial Intelligence Programming",
          "shortName": "AI Programming",
          "slug": "ics361",
          "number": "ICS 361",
          "description": "Introduction to the theory of Artificial Intelligence and the practical application of AI techniques in Functional (Common LISP and/or Scheme) and Logic (Prolog) programming languages. Students gain practical experience through programming assignments and projects.",
          "creditHrs": 3,
          "interests": [
            "artificial-intelligence",
            "lisp",
            "prolog"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS361.html",
          "prerequisites": [
            "ics212",
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Computing Ethics for Lab Assistants",
          "shortName": "Ethics for LAs",
          "slug": "ics390",
          "number": "ICS 390",
          "description": "A lecture/discussion/internship on ethical issues and instructional techniques for students assisting a laboratory section of ICS 101. The class uses multiple significant writing and oral presentation activities to help students learn course content.",
          "creditHrs": 3,
          "interests": [
            "teaching",
            "computer-ethics"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS390.html",
          "prerequisites": [
            "ics101"
          ]
        },
        {
          "name": "Software Engineering II",
          "shortName": "Software Eng II",
          "slug": "ics414",
          "number": "ICS 414",
          "description": "Continuation of 314. Project management, quality, and productivity control, testing and validation, team management. Team-oriented software-implementation project.",
          "creditHrs": 3,
          "interests": [
            "software-engineering",
            "application-development",
            "it-management"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS414.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Introduction to Programming for the Web",
          "shortName": "Intro to Web Programming",
          "slug": "ics415",
          "number": "ICS 415",
          "description": "Introduction to emerging technologies for construction of World Wide Web (WWW)-based software. Covers programming and scripting languages used for the creation of WWW sites and client-server programming. Students will complete a medium-sized software project that uses languages and concepts discussed in class.",
          "creditHrs": 3,
          "interests": [
            "application-development",
            "software-engineering"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS415.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "The Science, Psychology and Philosophy of Systems Design",
          "shortName": "Science of Systems Design",
          "slug": "ics419",
          "number": "ICS 419",
          "description": "Scientific, psychological and philosophical bases of systems design, including a survey of human-factors and ergonomic standards; the nature of innovation and creativity as it relates to systems design.",
          "creditHrs": 3,
          "interests": [
            "software-engineering",
            "hci"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS419.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Database Systems",
          "shortName": "Databases II",
          "slug": "ics421",
          "number": "ICS 421",
          "description": "Principles of database systems, data modeling, relational models, database design, query languages, query optimization, concurrency control data security.",
          "creditHrs": 3,
          "interests": [
            "databases"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS421.html",
          "prerequisites": [
            "ics321"
          ]
        },
        {
          "name": "Data Processing",
          "shortName": "Data Processing",
          "slug": "ics422",
          "number": "ICS 422",
          "description": "Role of data processing in organizations, programming practices, ethics, sequential and indexed file processing, report writing, online transaction processing.",
          "creditHrs": 3,
          "interests": [
            "databases"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS422.html",
          "prerequisites": [
            "ics321"
          ]
        },
        {
          "name": "Data Security and Cryptography I",
          "shortName": "Cryptography I",
          "slug": "ics423",
          "number": "ICS 423",
          "description": "History of secret communication and confidential data storage. Elements of cryptography and cryptanalysis. Classical ciphers. Symmetric key cryptography. Public key cryptography. Data security in cyberspace.",
          "creditHrs": 3,
          "interests": [
            "cryptography",
            "security"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS423.html",
          "prerequisites": [
            "ics355"
          ]
        },
        {
          "name": "Application Frameworks",
          "shortName": "Application Frameworks",
          "slug": "ics424",
          "number": "ICS 424",
          "description": "Experience producing applications with at least two different applications frameworks.",
          "creditHrs": 3,
          "interests": [
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS424.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Computer Security and Ethics",
          "shortName": "Security & Ethics",
          "slug": "ics425",
          "number": "ICS 425",
          "description": "Theoretical results, security policy, encryption, key management, digital signatures, certificates, passwords. Ethics: privacy, computer crime, professional ethics. Effects of the computer revolution on society.",
          "creditHrs": 3,
          "interests": [
            "security",
            "computer-ethics",
            "it-management"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS415.html",
          "prerequisites": [
            "ics355"
          ]
        },
        {
          "name": "Computer System Security",
          "shortName": "Computer System Security",
          "slug": "ics426",
          "number": "ICS 426",
          "description": "Information flow, confinement, information assurance, malicious programs, vulnerability analysis, network security, writing secure programs.",
          "creditHrs": 3,
          "interests": [
            "security",
            "it-management"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS426.html",
          "prerequisites": [
            "ics355"
          ]
        },
        {
          "name": "Computer Architecture",
          "shortName": "Computer Architecture",
          "slug": "ics431",
          "number": "ICS 431",
          "description": "Memory management, control flow, interrupt mechanisms, multiprocessor systems, special-purpose devices.",
          "creditHrs": 3,
          "interests": [
            "computer-architecture",
            "hardware"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS431.html",
          "prerequisites": [
            "ics331"
          ]
        },
        {
          "name": "Concurrent and High-Performance Programming",
          "shortName": "Concurrent Programming",
          "slug": "ics432",
          "number": "ICS 432",
          "description": "Principles of concurrent and high performance programming. Multi-threading in C and Java for shared-memory programming. Distributed memory programming with Java. Introduction to cluster computing.",
          "creditHrs": 3,
          "interests": [
            "parallel-programming",
            "hpc",
            "c",
            "java",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS432.html",
          "prerequisites": [
            "ics311",
            "ics314",
            "ics212"
          ]
        },
        {
          "name": "Machine Learning Fundamentals",
          "shortName": "Machine Learning",
          "slug": "ics435",
          "number": "ICS 435",
          "description": "Introduction to machine learning concepts with a focus on relevant ideas from computational neuroscience. Information processing and learning in the nervous system. Neural networks. Supervised and unsupervised learning. Basics of statistical learning theory.",
          "creditHrs": 3,
          "interests": [
            "machine-learning",
            "data-science"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS435.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Theory of Computation",
          "shortName": "Theory of Computation",
          "slug": "ics441",
          "number": "ICS 441",
          "description": "Grammars, sequential machines, equivalence, minimalization, analysis and synthesis, regular expressions, computability, unsolvability, Godel's theorem, Turing machines.",
          "creditHrs": 3,
          "interests": [
            "theory-of-computation",
            "algorithms"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS441.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Analytical Models and Methods",
          "shortName": "Analytics Models",
          "slug": "ics442",
          "number": "ICS 442",
          "description": "Applications of mathematical methods in computer science with emphasis on discrete mathematics, numerical computation, algebraic models, operations research.",
          "creditHrs": 3,
          "interests": [
            "algorithms"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS442.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Parallel Algorithms",
          "shortName": "Parallel Algorithms",
          "slug": "ics443",
          "number": "ICS 443",
          "description": "Introduction to parallel models of computation and design and analysis of parallel algorithms.",
          "creditHrs": 3,
          "interests": [
            "parallel-programming",
            "algorithms",
            "computer-architecture",
            "data-science",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS443.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Data Networks",
          "shortName": "Data Networks",
          "slug": "ics451",
          "number": "ICS 451",
          "description": "Network analysis, architecture, digital signal analysis and design; circuit switching, packet switching, packet broadcasting; protocols and standards; local area networks; satellite networks; ALOHA channels; examples.",
          "creditHrs": 3,
          "interests": [
            "networks",
            "c"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS451.html",
          "prerequisites": [
            "ics311",
            "ics314",
            "ics212"
          ]
        },
        {
          "name": "Software Design for Robotics",
          "shortName": "Robotics",
          "slug": "ics452",
          "number": "ICS 452",
          "description": "Sensors, actuators, signal processing, paradigms of robotic software design, introduction to machine learning, introduction to computer vision, and robot-to-human interaction.",
          "creditHrs": 3,
          "interests": [
            "robotics",
            "machine-learning",
            "hardware",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS452.html",
          "prerequisites": [
            "ics312",
            "ics313"
          ]
        },
        {
          "name": "Security and Trust II: Information Assurance",
          "shortName": "Security & Trust II",
          "slug": "ics455",
          "number": "ICS 455",
          "description": "Channel security. Trojan and noninterference. Basic concepts of cryptology. Cryptographic primitives. Protocols for authentication and key establishment.",
          "creditHrs": 3,
          "interests": [
            "security",
            "cryptography"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS455.html",
          "prerequisites": [
            "ics355"
          ]
        },
        {
          "name": "Artificial Intelligence",
          "shortName": "Artificial Intelligence",
          "slug": "ics461",
          "number": "ICS 461",
          "description": "Survey of artificial intelligence: natural language processing, vision and robotics, expert systems. Emphasis on fundamental concepts: search, planning, and problem solving, logic, knowledge representation.",
          "creditHrs": 3,
          "interests": [
            "artificial-intelligence",
            "algorithms",
            "data-science",
            "robotics"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS461.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Artificial Intelligence for Games",
          "shortName": "AI for Games",
          "slug": "ics462",
          "number": "ICS 462",
          "description": "Techniques to stimulate intelligence in video games: movement, pathfinding with A* search, decision/behavior trees, state machines, machine learning, tactics. Extend games with your own AI implementations; experience shootout contests for the best AI algorithm/implementation.",
          "creditHrs": 3,
          "interests": [
            "algorithms",
            "game-design",
            "artificial-intelligence",
            "machine-learning",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS462.html",
          "prerequisites": [
            "ics311",
            "ics314",
            "ics212"
          ]
        },
        {
          "name": "Human Computer Interaction I",
          "shortName": "HCI I",
          "slug": "ics464",
          "number": "ICS 464",
          "description": "Application of concepts and methodologies of human factors, psychology and software engineering to address ergonomic, cognitive, and social factors in the design and evaluation of human-computer systems.",
          "creditHrs": 3,
          "interests": [
            "software-engineering",
            "hci"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS464.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Introduction to Hypermedia",
          "shortName": "Hypermedia",
          "slug": "ics465",
          "number": "ICS 465",
          "description": "Basic issues of interactive access to information in various formats on computers. Available hardware and software: editing, integration, programming. Implementation of a sample information system.",
          "creditHrs": 3,
          "interests": [
            "software-engineering",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS465.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Design for Mobile Devices",
          "shortName": "Design for Mobile Devices",
          "slug": "ics466",
          "number": "ICS 466",
          "description": "Design issues, programming languages, operating systems and mark-up languages for internet-enabled mobile devices, such as cell phones and PDAs.",
          "creditHrs": 3,
          "interests": [
            "mobile",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS424.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Cognitive Science",
          "shortName": "Cognitive Science",
          "slug": "ics469",
          "number": "ICS 469",
          "description": "Introduces basic concepts, central problems, and methods from cognitive science. Identifies contributions from disciplines such as cognitive psychology, linguistics, artificial intelligence, philosophy, and neuroscience.",
          "creditHrs": 3,
          "interests": [
            "psychology",
            "artificial-intelligence",
            "cognitive-science",
            "hci"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS469.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Probability, Statistics, and Queuing",
          "shortName": "Probability & Statistics",
          "slug": "ics471",
          "number": "ICS 471",
          "description": "Introduction to probability, statistical inference, regression, Markov chains, queuing theory. Use of an interactive statistical graphics environment such as R.",
          "creditHrs": 3,
          "interests": [
            "r",
            "data-science",
            "algorithms"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS471.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Introduction to Bioinformatics Sequences and Genomes Analysis",
          "shortName": "Bioinformatics I",
          "slug": "ics475",
          "number": "ICS 475",
          "description": "Introduction to bioinformatics to computer sciences students by focusing on how computer science techniques can be used for the storage, analysis, prediction and simulation of biological sequences (DNA, RNA and proteins).",
          "creditHrs": 3,
          "interests": [
            "bioinformatics",
            "biology",
            "algorithms",
            "data-science"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS475.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Bioinformatics Algorithms and Tool Development",
          "shortName": "Bioinformatics II",
          "slug": "ics476",
          "number": "ICS 476",
          "description": "Study of commonly used bioinformatic algorithms, with an emphasis on string, tree, and graph algorithms. Presentation of probabilistic and clustering methods. Implementation of the studied algorithms and design of applications.",
          "creditHrs": 3,
          "interests": [
            "bioinformatics",
            "biology",
            "algorithms",
            "data-science"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS476.html",
          "prerequisites": [
            "ics475"
          ]
        },
        {
          "name": "Introduction to Computer Graphics",
          "shortName": "Computer Graphics",
          "slug": "ics481",
          "number": "ICS 481",
          "description": "Fundamentals of computer graphics including graphics hardware, representation, manipulation, and display of two- and three-dimensional objects, use of commercial software.",
          "creditHrs": 3,
          "interests": [
            "art",
            "computer-graphics"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS481.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Computer Vision",
          "shortName": "Computer Vision",
          "slug": "ics483",
          "number": "ICS 483",
          "description": "Introductory course in computer vision. Topics include image formation, image processing and filtering, edge detection, texture analysis and synthesis, binocular stereo, segmentation, tracking, object recognition and applications.",
          "creditHrs": 3,
          "interests": [
            "computer-vision",
            "algorithms"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS483.html",
          "prerequisites": [
            "ics311",
            "ics314",
            "ics212"
          ]
        },
        {
          "name": "Data Visualization",
          "shortName": "Data Visualization",
          "slug": "ics484",
          "number": "ICS 484",
          "description": "Introduction to data visualization through practical techniques for turning data into images to produce insight. Topics include: information visualization, geospatial visualization, scientific visualization, social network visualization, and medical visualization.",
          "creditHrs": 3,
          "interests": [
            "data-visualization",
            "computer-graphics",
            "data-science"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS484.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Video Game Design and Development",
          "shortName": "Game Design",
          "slug": "ics485",
          "number": "ICS 485",
          "description": "Students will team design, build, and demonstrate video games or related interactive entertainment environments and applications. Topics will include emerging computer science techniques relevant to the development of these types of environments.",
          "creditHrs": 3,
          "interests": [
            "computer-graphics",
            "art",
            "game-design",
            "application-development"
          ],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS485.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Special Topics",
          "shortName": "Special Topics",
          "slug": "ics491",
          "number": "ICS 491",
          "description": "Reflects special interests of faculty. Oriented toward juniors and seniors. Repeatable one time for BS/CS students.",
          "creditHrs": 3,
          "interests": [],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS485.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Special Topics in Security",
          "shortName": "Special Topics: Security",
          "slug": "ics495",
          "number": "ICS 495",
          "description": "Special topics in security oriented toward juniors and seniors. Repeatable unlimited times.",
          "creditHrs": 3,
          "interests": [],
          "syllabus": "http://courses.ics.hawaii.edu/syllabuses/ICS485.html",
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        },
        {
          "name": "Computer Project",
          "shortName": "Independent Study",
          "slug": "ics499",
          "number": "ICS 499",
          "description": "Individual or small-group projects in system design or application under faculty supervision.",
          "creditHrs": 3,
          "interests": [],
          "prerequisites": [
            "ics311",
            "ics314"
          ]
        }
      ]
    },
    {
      "name": "CourseInstanceCollection",
      "contents": [
        {
          "semester": "Fall-2015",
          "course": "ics111",
          "note": "ICS 111",
          "verified": true,
          "creditHrs": 4,
          "grade": "A",
          "student": "abi"
        },
        {
          "semester": "Fall-2015",
          "course": "ics141",
          "note": "ICS 141",
          "verified": true,
          "creditHrs": 3,
          "grade": "B+",
          "student": "abi"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "MATH 241",
          "verified": true,
          "creditHrs": 4,
          "grade": "B+",
          "student": "abi"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "ENG 100",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "abi"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "SOC 100",
          "verified": true,
          "creditHrs": 3,
          "grade": "B-",
          "student": "abi"
        },
        {
          "semester": "Spring-2016",
          "course": "ics211",
          "note": "ICS 211",
          "verified": true,
          "creditHrs": 4,
          "grade": "A",
          "student": "abi"
        },
        {
          "semester": "Spring-2016",
          "course": "ics241",
          "note": "ICS 241",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "abi"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "MATH 242",
          "verified": true,
          "creditHrs": 4,
          "grade": "B+",
          "student": "abi"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "HIST 151",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "abi"
        },
        {
          "semester": "Fall-2016",
          "course": "ics311",
          "note": "ICS 311",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Fall-2016",
          "course": "ics314",
          "note": "ICS 314",
          "verified": true,
          "creditHrs": 4,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Fall-2017",
          "course": "ics212",
          "note": "ICS 212",
          "verified": false,
          "creditHrs": 3,
          "grade": "C",
          "student": "abi"
        },
        {
          "semester": "Spring-2017",
          "course": "ics321",
          "note": "ICS 321",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Fall-2017",
          "course": "ics361",
          "note": "ICS 361",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Fall-2017",
          "course": "ics312",
          "note": "ICS 312",
          "verified": false,
          "creditHrs": 3,
          "grade": "A",
          "student": "abi"
        },
        {
          "semester": "Spring-2018",
          "course": "ics332",
          "note": "ICS 332",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Spring-2018",
          "course": "ics414",
          "note": "ICS 414",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Fall-2018",
          "course": "ics499",
          "note": "ICS 499",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Fall-2018",
          "course": "ics461",
          "note": "ICS 461",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Spring-2019",
          "course": "ics415",
          "note": "ICS 415",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Spring-2019",
          "course": "ics499",
          "note": "ICS 499",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "abi"
        },
        {
          "semester": "Fall-2016",
          "course": "other",
          "note": "JPN 201",
          "verified": true,
          "creditHrs": 4,
          "grade": "B",
          "student": "alfred"
        },
        {
          "semester": "Fall-2016",
          "course": "other",
          "note": "GG 101",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "alfred"
        },
        {
          "semester": "Fall-2016",
          "course": "ics241",
          "note": "ICS 241",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "alfred"
        },
        {
          "semester": "Fall-2016",
          "course": "other",
          "note": "GG 101L",
          "verified": true,
          "creditHrs": 1,
          "grade": "B",
          "student": "alfred"
        },
        {
          "semester": "Fall-2016",
          "course": "ics212",
          "note": "ICS 212",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "alfred"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "PSY 100",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "alfred"
        },
        {
          "semester": "Spring-2016",
          "course": "ics141",
          "note": "ICS 141",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "alfred"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "JPN 102",
          "verified": true,
          "creditHrs": 4,
          "grade": "B",
          "student": "alfred"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "HAW 100",
          "verified": true,
          "creditHrs": 3,
          "grade": "A+",
          "student": "alfred"
        },
        {
          "semester": "Spring-2016",
          "course": "ics211",
          "note": "ICS 211",
          "verified": true,
          "creditHrs": 4,
          "grade": "B+",
          "student": "alfred"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "ART 175",
          "verified": true,
          "creditHrs": 3,
          "grade": "C+",
          "student": "alfred"
        },
        {
          "semester": "Fall-2015",
          "course": "ics141",
          "note": "ICS 141",
          "verified": true,
          "creditHrs": 3,
          "grade": "D-",
          "student": "alfred"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "MUS 106",
          "verified": true,
          "creditHrs": 3,
          "grade": "CR",
          "student": "alfred"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "JPN 101",
          "verified": true,
          "creditHrs": 4,
          "grade": "CR",
          "student": "alfred"
        },
        {
          "semester": "Fall-2015",
          "course": "ics111",
          "note": "ICS 111",
          "verified": true,
          "creditHrs": 3,
          "grade": "CR",
          "student": "alfred"
        },
        {
          "semester": "Fall-2016",
          "course": "ics491",
          "note": "ICS 491",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Fall-2016",
          "course": "other",
          "note": "CHEM 162",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Fall-2016",
          "course": "ics499",
          "note": "ICS 499",
          "verified": true,
          "creditHrs": 4,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Fall-2016",
          "course": "other",
          "note": "CHEM 162L",
          "verified": true,
          "creditHrs": 1,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "CHEM 161",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "CHEM 161L",
          "verified": true,
          "creditHrs": 1,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Spring-2016",
          "course": "ics332",
          "note": "ICS 332",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Spring-2016",
          "course": "ics425",
          "note": "ICS 425",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Spring-2016",
          "course": "other",
          "note": "MATH 242",
          "verified": true,
          "creditHrs": 4,
          "grade": "C",
          "student": "betty"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "CHEM 131",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "betty"
        },
        {
          "semester": "Fall-2015",
          "course": "other",
          "note": "MATH 241",
          "verified": true,
          "creditHrs": 4,
          "grade": "B+",
          "student": "betty"
        },
        {
          "semester": "Fall-2015",
          "course": "ics361",
          "note": "ICS 361",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Fall-2015",
          "course": "ics311",
          "note": "ICS 311",
          "verified": true,
          "creditHrs": 4,
          "grade": "B+",
          "student": "betty"
        },
        {
          "semester": "Summer-2015",
          "course": "other",
          "note": "MATH 140",
          "verified": true,
          "creditHrs": 3,
          "grade": "CR",
          "student": "betty"
        },
        {
          "semester": "Spring-2015",
          "course": "ics212",
          "note": "ICS 212",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Spring-2015",
          "course": "ics241",
          "note": "ICS 241",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2014",
          "course": "ics141",
          "note": "ICS 141",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "betty"
        },
        {
          "semester": "Fall-2012",
          "course": "other",
          "note": "LTEC 448",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2012",
          "course": "other",
          "note": "PACS 108",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2012",
          "course": "other",
          "note": "JPN 211",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "betty"
        },
        {
          "semester": "Fall-2012",
          "course": "other",
          "note": "ACC 201",
          "verified": true,
          "creditHrs": 3,
          "grade": "CR",
          "student": "betty"
        },
        {
          "semester": "Summer-2012",
          "course": "other",
          "note": "ES 370",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Summer-2012",
          "course": "other",
          "note": "FR 259",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "betty"
        },
        {
          "semester": "Spring-2012",
          "course": "other",
          "note": "ART 123",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Spring-2012",
          "course": "other",
          "note": "ENG 414",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Spring-2012",
          "course": "other",
          "note": "FR 102",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "betty"
        },
        {
          "semester": "Spring-2012",
          "course": "other",
          "note": "ENG 352",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "betty"
        },
        {
          "semester": "Spring-2012",
          "course": "other",
          "note": "POLS 110",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2011",
          "course": "other",
          "note": "ENG 313",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2011",
          "course": "other",
          "note": "ENG 413",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2011",
          "course": "other",
          "note": "FR 101",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2011",
          "course": "ics211",
          "note": "ICS 211",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2011",
          "course": "other",
          "note": "HIST 151",
          "verified": true,
          "creditHrs": 3,
          "grade": "CR",
          "student": "betty"
        },
        {
          "semester": "Spring-2011",
          "course": "other",
          "note": "BOT 101",
          "verified": true,
          "creditHrs": 3,
          "grade": "A-",
          "student": "betty"
        },
        {
          "semester": "Spring-2011",
          "course": "other",
          "note": "BOT 101L",
          "verified": true,
          "creditHrs": 1,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Spring-2011",
          "course": "other",
          "note": "ENG 320",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Spring-2011",
          "course": "other",
          "note": "ENG 321",
          "verified": true,
          "creditHrs": 3,
          "grade": "B+",
          "student": "betty"
        },
        {
          "semester": "Spring-2011",
          "course": "other",
          "note": "PSY 100",
          "verified": true,
          "creditHrs": 3,
          "grade": "C",
          "student": "betty"
        },
        {
          "semester": "Spring-2011",
          "course": "ics111",
          "note": "ICS 111",
          "verified": true,
          "creditHrs": 4,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Summer-2010",
          "course": "other",
          "note": "JOUR 150",
          "verified": true,
          "creditHrs": 3,
          "grade": "A",
          "student": "betty"
        },
        {
          "semester": "Fall-2016",
          "course": "ics111",
          "note": "ICS 111",
          "verified": true,
          "creditHrs": 4,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Fall-2016",
          "course": "ics141",
          "note": "ICS 141",
          "verified": true,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2017",
          "course": "ics211",
          "note": "ICS 211",
          "verified": false,
          "creditHrs": 4,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2017",
          "course": "ics241",
          "note": "ICS 241",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Fall-2017",
          "course": "ics311",
          "note": "ICS 311",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Fall-2017",
          "course": "ics314",
          "note": "ICS 314",
          "verified": false,
          "creditHrs": 4,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2018",
          "course": "ics212",
          "note": "ICS 212",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2018",
          "course": "ics321",
          "note": "ICS 321",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Fall-2018",
          "course": "ics361",
          "note": "ICS 361",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Fall-2018",
          "course": "ics312",
          "note": "ICS 312",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2019",
          "course": "ics332",
          "note": "ICS 332",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2019",
          "course": "ics414",
          "note": "ICS 414",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Fall-2019",
          "course": "ics499",
          "note": "ICS 499",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Fall-2019",
          "course": "ics461",
          "note": "ICS 461",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2020",
          "course": "ics415",
          "note": "ICS 415",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        },
        {
          "semester": "Spring-2020",
          "course": "ics499",
          "note": "ICS 499",
          "verified": false,
          "creditHrs": 3,
          "grade": "B",
          "student": "charley"
        }
      ]
    },
    {
      "name": "DesiredDegreeCollection",
      "contents": [
        {
          "name": "B.S. in Computer Science",
          "shortName": "B.S. CS",
          "slug": "bs-cs",
          "description": "The Bachelor of Science in Computer Science provides you with an in-depth foundation in software technology, science, and math. You may find this degree of interest if you want to pursue software development as a career path or go to graduate school in computer science."
        },
        {
          "name": "B.S. in Computer Engineering",
          "shortName": "B.S. CE",
          "slug": "bs-ce",
          "description": "The Department of Information and Computer Sciences and the Department of Electrical Engineering offer a joint Bachelor of Science degree in Computer Engineering (BSCE).  The BSCE degree program provides you with the opportunity to learn about computer hardware and software, computer organization and architecture, computer security, software engineering, computer networks and Internet technology, embedded systems, computer-aided design, multi-core and parallel computing, wireless networks, and other topics."
        },
        {
          "name": "B.A. in Information and Computer Sciences",
          "shortName": "B.A. ICS",
          "slug": "ba-ics",
          "description": "The Bachelor of Arts (BA) degree allows you to combine computer science with another discipline. You might find the BA degree of interest if you are also interested in biology, entrepreneurship, game design, graphic arts, financial engineering, foreign languages, or other disciplines."
        }
      ]
    },
    {
      "name": "FeedCollection",
      "contents": [
        {
          "student": "abi",
          "timestamp": 1483912874942
        }
      ]
    },
    {
      "name": "FeedbackCollection",
      "contents": [
        {
          "name": "ICE innovation points",
          "slug": "iceInnovationPoints",
          "description": "Recommendation for ICE innovation points.",
          "feedbackType": "Recommendation"
        },
        {
          "name": "ICE competency points",
          "slug": "iceCompetencyPoints",
          "description": "Recommendation for ICE competency points.",
          "feedbackType": "Recommendation"
        },
        {
          "name": "ICE experience points",
          "slug": "iceExperiencePoints",
          "description": "Recommendation for ICE experience points.",
          "feedbackType": "Recommendation"
        },
        {
          "name": "Upload STAR data",
          "slug": "updateStarData",
          "description": "See your ICS advisor to upload STAR data",
          "feedbackType": "Recommendation"
        },
        {
          "name": "Course recommendations based on interests",
          "slug": "CourseRecommendationsBasedOnInterests",
          "description": "These courses are recommended based upon your interests.",
          "feedbackType": "Recommendation"
        },
        {
          "name": "Required course missing",
          "slug": "requiredCourseMissing",
          "description": "A required course is missing.",
          "feedbackType": "Warning"
        },
        {
          "name": "Prerequisite missing",
          "slug": "prerequisiteMissing",
          "description": "A prerequisite course is missing.",
          "feedbackType": "Warning"
        },
        {
          "name": "Semester overloaded",
          "slug": "semesterOverloaded",
          "description": "Semester appears overloaded.",
          "feedbackType": "Warning"
        },
        {
          "name": "Course not likely to be offered",
          "slug": "courseNotOffered",
          "description": "Your plan include a course that is not offered in the semester",
          "feedbackType": "Warning"
        }
      ]
    },
    {
      "name": "FeedbackInstanceCollection",
      "contents": [
        {
          "feedback": "CourseRecommendationsBasedOnInterests",
          "user": "alfred",
          "description": "We recommend ICS 314 based on your interest in software engineering",
          "area": "Interests"
        },
        {
          "feedback": "iceInnovationPoints",
          "user": "alfred",
          "description": "You need 22 more Innovation points in your plan to get to 100.",
          "area": "ICE"
        },
        {
          "feedback": "updateStarData",
          "user": "alfred",
          "description": "See your ICS advisor to upload STAR data from Spring 2016.",
          "area": "STAR"
        },
        {
          "feedback": "requiredCourseMissing",
          "user": "alfred",
          "description": "Required course ICS 212 does not appear in your degree plan.",
          "area": "DegreePlan"
        },
        {
          "feedback": "semesterOverloaded",
          "user": "alfred",
          "description": "Fall 2017 appears overloaded with course work.",
          "area": "Overload"
        },
        {
          "feedback": "courseNotOffered",
          "user": "alfred",
          "description": "Your plan includes ICS 451 in Fall 2017, but it is unlikely to occur then.",
          "area": "DegreePlan"
        },
        {
          "feedback": "iceInnovationPoints",
          "user": "abi",
          "description": "You need 22 more Innovation points in your plan to get to 100.",
          "area": "ICE"
        },
        {
          "feedback": "iceCompetencyPoints",
          "user": "abi",
          "description": "You need 7 more Innovation points in your plan to get to 100.",
          "area": "ICE"
        },
        {
          "feedback": "updateStarData",
          "user": "abi",
          "description": "See your ICS advisor to upload STAR data from Spring 2016.",
          "area": "STAR"
        },
        {
          "feedback": "prerequisiteMissing",
          "user": "abi",
          "description": "Fall 2017: ICS 361's prerequisite ICS 212 is after or in Fall 2017.",
          "area": "DegreePlanPrerequisites"
        },
        {
          "feedback": "prerequisiteMissing",
          "user": "abi",
          "description": "Fall 2017: ICS 312's prerequisite ICS 212 is after or in Fall 2017.",
          "area": "DegreePlanPrerequisites"
        }
      ]
    },
    {
      "name": "HelpMessageCollection",
      "contents": [
        {
          "routeName": "Advisor_Student_Configuration_Page",
          "title": "Setting up a new Student.",
          "text": "You can update a student's degree plan, or view the student's current degree plan."
        },
        {
          "routeName": "Student_Home_Page",
          "title": "Learn about your home page",
          "text": "<p>Your home page provides the latest information on your degree plan.</p>\n\n<p>The Content of Interest pane provides information on selected opportunities and courses that we hope will be of interest to you based on your selected interests and career goals. Click \"View More\" to go to a page with details, \"Add to plan\" to add it to your Degree Plan, and \"Hide\" if you're not interested in this content and don't want to see it in your feed.</p>\n\n<p>The ICS Teaser pane provides very short videos by ICS community members. When you have a spare moment, take a look at a video or two! </p>\n\n<p>Finally, the Recent Community Activity pane gives you a sense of what other ICS students are doing.</p>\n\n<p>(If you want to remove this help pane from this page, click on the \"X\" in the upper right corner to hide it. You can always bring it back from your profile page.)</p>"
        },
        {
          "routeName": "Student_Ice",
          "title": "Learn about ICE",
          "text": "<div class=\"active content\">\n<p>ICE points are a way for students to gauge the progression and balance of innovation, competency, and experience in their ICS degree program.</p>\n<p>There are three graphs that display your ICE score: <span class=\"innovation\">Innovation (blue)</span>, <span class=\"competency\">Competence (green)</span>, and <span class=\"experience\">Experience (orange)</span>. The total amount of possible points for each graph is 100. Each graph has a dark fill, and a light fill. The dark fill represents the actual amount of points you have. These are points gathered from completing and getting approval from various events. The light fill represents the projected amount of points you have. These are the amount of points that you will have after completing and getting approval from all events on your schedule plan. This includes future events that have yet to occur. The fraction on the inside of the graph is a numerical representation of the same data. The first number is the amount of actual points you have, and the second number is the amount of projected points you have.</p>\n\n<div class=\"ui equal width grid container\">\n<div class=\"row\"><div class=\"column\"><div class=\"ui equal width grid container\"><div class=\"row\"><div style=\"margin-left:auto; margin-right:auto\" class=\"c100 p100 blue\"><span>I</span><div class=\"slice\"><div class=\"bar\"></div><div class=\"fill\"></div></div></div></div><div class=\"centered row\"><h3 class=\"ui header\">Innovation</h3></div><div class=\"row\"> <p>Students can gain Innovation points by completing the following actions:</p></div><div class=\"row\">    <div class=\"ui list\">    <div class=\"item\">    <div class=\"content\">    <a class=\"header\">Complete a personal ICS related project.</a><div class=\"description\">This includes web development, mobile app development, algorithm research, etc.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Participate in a public competitive computer science event.</a><div class=\"description\">This includes hackathons, cybersecurity competitions, coding competitions, etc.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Contribute to an open source project.</a><div class=\"description\">Credit will be given for substantial contributions, as decided by the adviser.</div></div></div></div></div></div></div><div class=\"column\">    <div class=\"ui equal width grid container\">    <div class=\"row\">    <div style=\"margin-left:auto; margin-right:auto\" class=\"c100 p100 green\">    <span>C</span>    <div class=\"slice\">    <div class=\"bar\"></div>    <div class=\"fill\"></div>   </div>    </div>    </div>    <div class=\"centered row\">    <h3 class=\"ui header\">Competency</h3>    </div>    <div class=\"row\">    <p>Students can gain Competency points by completing the following actions:</p></div><div class=\"row\">    <div class=\"ui list\">    <div class=\"item\">    <div class=\"content\">    <a class=\"header\">Complete an ICS course with a B- or higher.</a><div class=\"description\">These courses must appear on your STAR records.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Achieve a semester GPA of at least a 3.0.</a><div class=\"description\">The GPA must appear on your STAR records.</div></div></div></div></div></div></div><div class=\"column\">    <div class=\"ui equal width grid container\">    <div class=\"row\">    <div style=\"margin-left:auto; margin-right:auto\" class=\"c100 p100 orange\">    <span>E</span>    <div class=\"slice\">    <div class=\"bar\"></div>    <div class=\"fill\"></div>    </div>    </div>    </div>    <div class=\"centered row\">    <h3 class=\"ui header\">Experience</h3>    </div>    <div class=\"row\">    <p>Students can gain Experience points by completing the following actions:</p></div><div class=\"row\">    <div class=\"ui list\">    <div class=\"item\">    <div class=\"content\">    <a class=\"header\">Complete an ICS related internship.</a><div class=\"description\">This internship must appear on your RadGrad account.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Work at an ICS related job for a semester.</a><div class=\"description\">This opportunity must appear on your RadGrad account.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Participate in a study under a professor.</a><div class=\"description\">This opportunity must appear on your RadGrad account.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Attend a professional networking event.</a><div class=\"description\">This includes ACM's Professional Interaction Night, Wetware Wednesdays, etc.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Attend a professional development workshop.</a><div class=\"description\">This includes resume workshops, Techfolio workshops, etc.</div></div></div><div class=\"item\">    <div class=\"content\">    <a class=\"header\">Attend a technical talk.</a><div class=\"description\">This includes formal talks given by graduate students, professors, and outside professionals.</div></div></div></div></div></div></div></div></div></div>"
        },
        {
          "routeName": "Student_Degree_Planner_Page",
          "title": "Modify Your Degree Plan",
          "text": "Stuff"
        }
      ]
    },
    {
      "name": "InterestCollection",
      "contents": [
        {
          "name": "Algorithms",
          "slug": "algorithms",
          "description": "Simply put, an algorithm is a self-contained step-by-step set of operations to be performed. More specifically, an algorithm is an effective method that can be expressed within a finite amount of space and time and in a well-defined formal language for calculating a function. Starting from an initial state and initial input (perhaps empty), the instructions describe a computation that, when executed, proceeds through a finite number of well-defined successive states, eventually producing \"output\" and terminating at a final ending state. The transition from one state to the next is not necessarily deterministic; some algorithms, known as randomized algorithms, incorporate random input.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Algorithm"
        },
        {
          "name": "Application Development",
          "slug": "application-development",
          "description": "Application development is the use of tools, technologies, procedures, and domain knowledge to create and maintain useful software and/or hardware systems.",
          "interestType": "Nu4K93FuWP8rZpms5"
        },
        {
          "name": "Artificial Intelligence",
          "slug": "artificial-intelligence",
          "description": "The use of hardware and software to create a flexible rational agent that perceives its environment and takes actions that maximize its chance of success at an arbitrary goal. Colloquially, the term \"artificial intelligence\" is likely to be applied when a machine uses cutting-edge techniques to competently perform or mimic functions that we intuitively associate with human minds, such as \"learning\" and \"problem solving\".",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Artificial_intelligence"
        },
        {
          "name": "Bioinformatics",
          "slug": "bioinformatics",
          "description": "Bioinformatics is an interdisciplinary field combining computer science, statistics, mathematics, and engineering that develops methods and software tools for understanding biological data. Common uses of bioinformatics include the identification of candidate genes and nucleotides (SNPs). Often, such identification is made with the aim of better understanding the genetic basis of disease, unique adaptations, desirable properties (esp. in agricultural species), or differences between populations.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Bioinformatics"
        },
        {
          "name": "Computer Architecture",
          "slug": "computer-architecture",
          "description": "Computer architecture describes the functionality, organization, and implementation of computer systems. Some architectures define the capabilities and programming model of a computer but not a particular implementation. Others include instruction set design, micro-architecture design, logic design, and implementation. Computer architecture can focus on hardware or can include both hardware and software.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Computer_architecture"
        },
        {
          "name": "Computer Graphics",
          "slug": "computer-graphics",
          "description": "Computer graphics are pictures and movies created using computers - usually referring to image data created by a computer specifically with help from specialized graphical hardware and software. Important topics in computer graphics include user interface design, sprite graphics, vector graphics, 3D modeling, shaders, GPU design, and computer vision. The overall methodology depends heavily on the sciences of geometry, optics, and physics. Computer graphic development has had a significant impact on many types of media and has revolutionized animation, movies, advertising, video games, and graphic design generally.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Computer_graphics"
        },
        {
          "name": "Computer Vision",
          "slug": "computer-vision",
          "description": "Computer vision is a field that includes methods for acquiring, processing, analyzing, and understanding images and, in general, high-dimensional data from the real world in order to produce numerical or symbolic information that can be used to take action. A common theme is to duplicate the abilities of human vision by electronically perceiving and understanding an image. Subdomains of computer vision include scene reconstruction, event detection, video tracking, object recognition, object pose estimation, learning, indexing, motion estimation, and image restoration.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Computer_vision"
        },
        {
          "name": "Cognitive Science",
          "slug": "cognitive-science",
          "description": "Cognitive science is the interdisciplinary scientific study of the mind and its processes. It examines what cognition is, what it does and how it works. It includes research on intelligence and behaviour, especially focusing on how information is represented, processed, and transformed (in faculties such as perception, language, memory, attention, reasoning, and emotion) within nervous systems (humans or other animals) and machines (e.g. computers). Cognitive science includes multiple research disciplines, including psychology, artificial intelligence, philosophy, neuroscience, linguistics, and anthropology.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Cognitive_science"
        },
        {
          "name": "Cryptography",
          "slug": "cryptography",
          "description": "Cryptography is the study of techniques for secure communication: constructing and analyzing protocols that prevent third parties or the public from reading private messages. Data confidentiality, data integrity, authentication, and non-repudiation are central to modern cryptography. Modern cryptography exists at the intersection of mathematics, computer science, and electrical engineering. Applications of cryptography include ATM cards, computer passwords, and electronic commerce.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Cryptography"
        },
        {
          "name": "Databases",
          "slug": "databases",
          "description": "A database is an organized collection of data. It includes schemas, tables, queries, reports, views and other objects. The data are typically organized to model aspects of reality in a way that supports processes requiring information, such as modelling the availability of rooms in hotels in a way that supports finding a hotel with vacancies. Access to these data is usually provided by a \"database management system\" (DBMS) consisting of an integrated set of computer software that allows users to interact with one or more databases and provides access to all of the data contained in the database (although restrictions may exist that limit access to particular data). The DBMS provides various functions that allow entry, storage and retrieval of large quantities of information and provides ways to manage how that information is organized.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Database"
        },
        {
          "name": "Data Visualization",
          "slug": "data-visualization",
          "description": "Data visualization is both an art and a science. A primary goal of data visualization is to communicate information clearly and efficiently via statistical graphics, plots and information graphics. Numerical data may be encoded using dots, lines, or bars, to visually communicate a quantitative message. Effective visualization helps users analyze and reason about data and evidence. It makes complex data more accessible, understandable and usable.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Data_visualization"
        },
        {
          "name": "Data Science",
          "slug": "data-science",
          "description": "Data science is an interdisciplinary field about processes and systems to extract knowledge or insights from data in various forms, either structured or unstructured. Data science employs techniques and theories drawn from many fields within the broad areas of mathematics, statistics, information science, and computer science, including signal processing, probability models, machine learning, statistical learning, data mining, database, data engineering, pattern recognition and learning, visualization, predictive analytics, uncertainty modeling, data warehousing, data compression, computer programming, artificial intelligence, and high performance computing. Methods that scale to big data are of particular interest in data science. Data science affects many domains, including machine translation, speech recognition, robotics, search engines, digital economy, but also the biological sciences, medical informatics, health care, social sciences and the humanities.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Data_science"
        },
        {
          "name": "Computer Ethics",
          "slug": "computer-ethics",
          "description": "Computer Ethics is a part of practical philosophy which concerns with how computing professionals should make decisions regarding professional and social conduct. Computer ethics can inform issues such as copyright infringement, privacy, piracy, and social informatics.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Computer_ethics"
        },
        {
          "name": "Entrepreneurship",
          "slug": "entrepreneurship",
          "description": "Entrepreneurship is the process of designing, launching and running a new business, such as a startup company offering a product, process or service. It requires the capacity and willingness to develop, organize, and manage a business venture along with any of its risks in order to make a profit. Entrepreneurs tend to be good at perceiving new business opportunities and they often exhibit positive biases in their perception (i.e., a bias towards finding new possibilities and seeing unmet market needs) and a pro-risk-taking attitude that makes them more likely to exploit the opportunity.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Entrepreneurship"
        },
        {
          "name": "Game design",
          "slug": "game-design",
          "description": "Game design is the art of applying design and aesthetics to create a game to facilitate interaction between players for entertainment or for medical, educational, or experimental purposes. Game design creates goals, rules, and challenges to produce desirable interactions among its participants and, possibly, spectators.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Game_design"
        },
        {
          "name": "Graduate School",
          "slug": "graduate-school",
          "description": "Graduate school in computer science leads to an M.S. or Ph.D degree. An M.S. is typically a technical degree that gives you more advanced skills and thus makes available more interesting (and more highly paid) job opportunities. A Ph.D. is a research degree, which opens up entirely different kinds of opportunities (such as University Professors in academia and Research Group managers in industry).",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://www.cs.princeton.edu/academics/ugradpgm/gsg"
        },
        {
          "name": "Hardware",
          "slug": "hardware",
          "description": "Computer hardware is the physical parts or components of a computer, such as the monitor, mouse, keyboard, computer data storage, hard disk drive (HDD), graphic cards, sound cards, memory (RAM), motherboard, and so on, all of which are tangible physical objects. By contrast, software is instructions that can be stored and run by hardware.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Computer_hardware"
        },
        {
          "name": "Human-Computer Interaction",
          "slug": "hci",
          "description": "Researchers in the field of HCI both observe the ways in which humans interact with computers and design technologies that let humans interact with computers in novel ways. Human-computer interaction is situated at the intersection of computer science, behavioral sciences, design, and media studies.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Human%E2%80%93computer_interaction"
        },
        {
          "name": "High Performance Computing",
          "slug": "hpc",
          "description": "High Performance Computing concerns the hardware and software capabilities required for effective use of \"supercomputers\". HPC techniques are needed for computationally intensive tasks in various fields, including quantum mechanics, weather forecasting, climate research, oil and gas exploration, molecular modeling (computing the structures and properties of chemical compounds, biological macromolecules, polymers, and crystals), and physical simulations (such as simulations of the early moments of the universe, airplane and spacecraft aerodynamics, the detonation of nuclear weapons, and nuclear fusion). Throughout their history, they have been essential in the field of cryptanalysis.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Supercomputer"
        },
        {
          "name": "Machine Learning",
          "slug": "machine-learning",
          "description": "Machine learning is a subfield of computer science that evolved from the study of pattern recognition and computational learning theory in artificial intelligence. Machine learning explores the study and construction of algorithms that can learn from and make predictions on data. Such algorithms operate by building a model from example inputs in order to make data-driven predictions or decisions expressed as outputs. Machine learning is employed in a range of computing tasks where designing and programming explicit algorithms is infeasible. Example applications include spam filtering, optical character recognition (OCR), search engines, and computer vision.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Machine_learning"
        },
        {
          "name": "IT Management",
          "slug": "it-management",
          "description": "IT management is the discipline whereby all of the information technology resources of a firm are managed in accordance with its needs and priorities. These resources may include tangible investments like computer hardware, software, data, networks and data centre facilities, as well as the staff who are hired to maintain them. Managing this responsibility within a company entails many of the basic management functions, like budgeting, staffing, change management, and organizing and controlling, along with other aspects that are unique to technology, like software design, network planning, tech support etc.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Information_technology_management"
        },
        {
          "name": "Mobile Computing",
          "slug": "mobile",
          "description": "Mobile computing is human–computer interaction by which a computer is expected to be transported during normal usage, which allows for transmission of data, voice and video. Mobile computing involves mobile communication, mobile hardware, and mobile software. Communication issues include ad hoc networks and infrastructure networks as well as communication properties, protocols, data formats and concrete technologies. Hardware includes mobile devices or device components. Mobile software deals with the characteristics and requirements of mobile applications.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Mobile_computing"
        },
        {
          "name": "Networks",
          "slug": "networks",
          "description": "A computer network or data network is a telecommunications network which allows computers to exchange data. In computer networks, networked computing devices exchange data with each other using a data link. The connections between nodes are established using either cable media or wireless media. The best-known computer network is the Internet.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Computer_network"
        },
        {
          "name": "Operating Systems",
          "slug": "operating-systems",
          "description": "An operating system (OS) is system software that manages computer hardware and software resources and provides common services for computer programs. Examples of popular desktop operating systems include Apple OS X, Linux and its variants, and Microsoft Windows. So-called mobile operating systems include Android and iOS. Other classes of operating systems, such as real-time (RTOS), also exist.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Operating_system"
        },
        {
          "name": "Parallel Programming",
          "slug": "parallel-programming",
          "description": "Parallel programming refers to a type of computation in which many calculations are carried out simultaneously, operating on the principle that large problems can often be divided into smaller ones, which are then solved at the same time. In some cases parallelism is transparent to the programmer, such as in bit-level or instruction-level parallelism, but explicitly parallel algorithms, particularly those that use concurrency, are more difficult to write than sequential ones, because concurrency introduces several new classes of potential software bugs, of which race conditions are the most common. Communication and synchronization between the different subtasks are typically some of the greatest obstacles to getting good parallel program performance.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Parallel_computing"
        },
        {
          "name": "Robotics",
          "slug": "robotics",
          "description": "Robotics is the branch of mechanical engineering, electrical engineering and computer science that deals with the design, construction, operation, and application of robots, as well as computer systems for their control, sensory feedback, and information processing. Robots can take the place of humans in dangerous environments or manufacturing processes, or resemble humans in appearance, behaviour, and or cognition. Many robots are inspired by nature contributing to the field of bio-inspired robotics.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Robotics"
        },
        {
          "name": "Security",
          "slug": "security",
          "description": "Computer security, also known as cybersecurity or IT security, is the protection of information systems from theft or damage to the hardware, the software, and to the information on them, as well as from disruption or misdirection of the services they provide. It includes controlling physical access to the hardware, as well as protecting against harm that may come via network access, data and code injection, and due to malpractice by operators, whether intentional, accidental, or due to them being tricked into deviating from secure procedures.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Computer_security"
        },
        {
          "name": "Software Engineering",
          "slug": "software-engineering",
          "description": "The systematic application of scientific and technological knowledge, methods, and experience to the design, implementation, testing, and documentation of software. The discipline of software engineering was created to address poor quality of software, get projects exceeding time and budget under control, and ensure that software is built systematically, rigorously, measurably, on time, on budget, and within specification. In 2012, Software Engineering was ranked as the best job in the United States by CareerCast.com.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Software_engineering"
        },
        {
          "name": "Teaching",
          "slug": "teaching",
          "description": "Teaching is the process of facilitating learning, or the acquisition of knowledge, skills, values, beliefs, and habits. Educational methods include storytelling, discussion, teaching, training, and directed research.",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Education"
        },
        {
          "name": "Theory of computation",
          "slug": "theory-of-computation",
          "description": "Theory of computation deals with how efficiently problems can be solved on a model of computation, using an algorithm. The field is divided into three major branches: automata theory and language, computability theory, and computational complexity theory, which are linked by the question: \"What are the fundamental capabilities and limitations of computers?\".",
          "interestType": "Nu4K93FuWP8rZpms5",
          "moreInformation": "https://en.wikipedia.org/wiki/Theory_of_computation"
        },
        {
          "name": "Art",
          "slug": "art",
          "description": "A diverse range of human activities in creating visual, auditory or performing artifacts artworks, expressing the author's imaginative or technical skill, intended to be appreciated for their beauty or emotional power.",
          "interestType": "JCNWSgSd2uKH85sdc",
          "moreInformation": "https://en.wikipedia.org/wiki/Art"
        },
        {
          "name": "Biology",
          "slug": "biology",
          "description": "A natural science concerned with the study of life and living organisms, including their structure, function, growth, evolution, distribution, and taxonomy.",
          "interestType": "JCNWSgSd2uKH85sdc",
          "moreInformation": "https://en.wikipedia.org/wiki/Biology"
        },
        {
          "name": "Psychology",
          "slug": "psychology",
          "description": "The scientific study of the human mind and its functions, especially those affecting behavior in a given context.",
          "interestType": "JCNWSgSd2uKH85sdc",
          "moreInformation": "https://en.wikipedia.org/wiki/Psychology"
        },
        {
          "name": "Android",
          "slug": "android",
          "description": "Android is a mobile operating system (OS) currently developed by Google, based on the Linux kernel and designed primarily for touchscreen mobile devices such as smartphones and tablets. In addition to touchscreen devices, Google has further developed Android TV for televisions, Android Auto for cars, and Android Wear for wrist watches, each with a specialized user interface. Variants of Android are also used on notebooks, game consoles, digital cameras, and other electronics. Android has the largest installed base of all operating systems of any kind. Android has been the best selling OS on tablets since 2013, and on smartphones it is dominant by any metric.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://www.android.com/"
        },
        {
          "name": "Assembler",
          "slug": "assembler",
          "description": "An assembler (or assembly) language is a low-level programming language for a computer in which there is a direct correspondence between the language and the architecture's machine code instructions. Each assembly language is specific to a particular computer architecture, in contrast to most high-level programming languages, which are generally portable across multiple architectures, but require interpreting or compiling. Assembly language may also be called symbolic machine code. Assembly language is converted into executable machine code by a utility program referred to as an assembler. The conversion process is referred to as assembly, or assembling the source code.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/Assembly_language"
        },
        {
          "name": "C",
          "slug": "c",
          "description": "C is a general-purpose, imperative computer programming language, supporting structured programming, lexical variable scope and recursion, and includes a static type system that prevents many unintended operations. By design, C provides constructs that map efficiently to typical machine instructions, and therefore it has found lasting use in applications that had formerly been coded in assembly language. Despite its low-level capabilities, the language was designed to encourage cross-platform programming. A standards-compliant and portably written C program can be compiled for a very wide variety of computer platforms and operating systems with few changes to its source code. The language has become available on a very wide range of platforms, from embedded microcontrollers to supercomputers.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/C_(programming_language)"
        },
        {
          "name": "C++",
          "slug": "cplusplus",
          "description": "C++ is a general-purpose programming language. It has imperative, object-oriented and generic programming features, while also providing facilities for low-level memory manipulation. It was designed with a bias toward system programming and embedded, resource-constrained and large systems, with performance, efficiency and flexibility of use as its design highlights. Many other programming languages have been influenced by C++, including C#, Java, and newer versions of C (after 1998).",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/C_(programming_language)"
        },
        {
          "name": "Java",
          "slug": "java",
          "description": "Java is a general-purpose computer programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible. It is intended to let application developers \"write once, run anywhere\", meaning that compiled Java code can run on all platforms that support Java without the need for recompilation. Java applications are typically compiled to bytecode that can run on any Java virtual machine regardless of computer architecture. As of 2016, Java is one of the most popular programming languages in use, particularly for client-server web applications, with a reported 9 million developers.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/Java_(programming_language)"
        },
        {
          "name": "Javascript",
          "slug": "javascript",
          "description": "JavaScript is a high-level, dynamic, untyped, and interpreted programming language. Despite some syntactic similarities, JavaScript and Java are otherwise unrelated and have very different semantics. Alongside HTML and CSS, Javascript is one of the three core technologies of World Wide Web content production; the majority of websites employ it and it is supported by all modern Web browsers without plug-ins. JavaScript is prototype-based with first-class functions, making it a multi-paradigm language, supporting object-oriented, imperative, and functional programming styles. It has an API for working with text, arrays, dates and regular expressions, but does not include any I/O, such as networking, storage, or graphics facilities, relying for these upon the host environment in which it is embedded.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/JavaScript"
        },
        {
          "name": "Lisp",
          "slug": "lisp",
          "description": "Lisp is a family of computer programming languages with a long history and a distinctive, fully parenthesized prefix notation. Originally specified in 1958, Lisp is the second-oldest high-level programming language in widespread use today; only Fortran is older (by one year). Lisp was originally created as a practical mathematical notation for computer programs, influenced by the notation of Alonzo Church's lambda calculus. It quickly became the favored programming language for artificial intelligence (AI) research. As one of the earliest programming languages, Lisp pioneered many ideas in computer science, including tree data structures, automatic storage management, dynamic typing, conditionals, higher-order functions, recursion, and the self-hosting compiler.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/Lisp_(programming_language)"
        },
        {
          "name": "Linux",
          "slug": "linux",
          "description": "A Unix-like and mostly POSIX-compliant computer operating system (OS) assembled under the model of free and open-source software development and distribution. Linux was originally developed as a free operating system for personal computers based on the Intel x86 architecture, but has since been ported to more computer hardware platforms than any other operating system. Because of the dominance of Android on smartphones, Linux has the largest installed base of all general-purpose operating systems.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/Linux"
        },
        {
          "name": "Perl",
          "slug": "perl",
          "description": "Perl is a family of high-level, general-purpose, interpreted, dynamic programming languages. Perl 5 is used for graphics programming, system administration, network programming, finance, bioinformatics, and other applications. It has been nicknamed \"the Swiss Army chainsaw of scripting languages\" because of its flexibility and power, and possibly also because of its \"ugliness\". In 1998, it was also referred to as the \"duct tape that holds the Internet together\", in reference to both its ubiquitous use as a glue language and its perceived inelegance.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://www.perl.org/"
        },
        {
          "name": "Prolog",
          "slug": "prolog",
          "description": "Prolog is a general-purpose logic programming language associated with artificial intelligence and computational linguistics. Prolog has its roots in first-order logic, a formal logic, and unlike many other programming languages, Prolog is declarative: the program logic is expressed in terms of relations, represented as facts and rules. The language has been used for theorem proving, expert systems, as well as its original intended field of use, natural language processing.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/Prolog"
        },
        {
          "name": "Python",
          "slug": "python",
          "description": "Python is a widely used high-level, general-purpose, interpreted, dynamic programming language. Its design philosophy emphasizes code readability, and its syntax allows programmers to express concepts in fewer lines of code than would be possible in languages such as C++ or Java. Python supports multiple programming paradigms, including object-oriented, imperative and functional programming or procedural styles. It features a dynamic type system and automatic memory management and has a large and comprehensive standard library.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://www.python.org/"
        },
        {
          "name": "R",
          "slug": "r",
          "description": "R is a programming language and software environment that is widely used among statisticians and data miners for developing statistical software and data analysis. R and its libraries implement a wide variety of statistical and graphical techniques, including linear and nonlinear modeling, classical statistical tests, time-series analysis, classification, clustering, and others.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/R_(programming_language)"
        },
        {
          "name": "Ruby",
          "slug": "ruby",
          "description": "Ruby is a dynamic, reflective, object-oriented, general-purpose programming language. Ruby was influenced by Perl, Smalltalk, Eiffel, Ada, and Lisp. It supports multiple programming paradigms, including functional, object-oriented, and imperative. It also has a dynamic type system and automatic memory management. Ruby's creator, Yukihiro Matsumoto, has stated, \"I hope to see Ruby help every programmer in the world to be productive, and to enjoy programming, and to be happy. That is the primary purpose of Ruby language.\"",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "http://www.ruby-lang.org/en/"
        },
        {
          "name": "SQL",
          "slug": "sql",
          "description": "SQL (Structured Query Language) is a special-purpose programming language designed for managing data held in a relational database management system , or for stream processing in a relational data stream management system. Originally based upon relational algebra and tuple relational calculus, SQL consists of a data definition language, data manipulation language, and a data control language. The scope of SQL includes data insert, query, update and delete, schema creation and modification, and data access control.",
          "interestType": "394trBCfrYj8hqZ6h",
          "moreInformation": "https://en.wikipedia.org/wiki/SQL"
        }
      ]
    },
    {
      "name": "InterestTypeCollection",
      "contents": [
        {
          "name": "CS Disciplines",
          "slug": "cs-disciplines",
          "description": "Computer science and engineering areas of interest, not including languages, tools, technologies."
        },
        {
          "name": "Non-CS Disciplines",
          "slug": "non-cs-disciplines",
          "description": "Areas of interest apart from computer science and engineering."
        },
        {
          "name": "technologies",
          "slug": "technologies",
          "description": "Computer science and engineering languages, tools, and technologies"
        }
      ]
    },
    {
      "name": "OpportunityCollection",
      "contents": [
        {
          "name": "HI-SEAS",
          "slug": "apps-for-high-latency-communication",
          "description": "HI-SEAS (Hawaii Space Exploration Analog and Simulation) simulates the conditions of long-duration human space exploration. Due to the distance between Earth and Mars, it takes 4-24 minutes for a signal to get from one to the other. However, most communication software is designed for much lower latency. For this project, you will design and implement a communications/social-media app that can handle high latency gracefully.",
          "opportunityType": "MGzFhqnAx7HYcfuwj",
          "sponsor": "binsted",
          "ice": {
            "i": 25,
            "c": 0,
            "e": 25
          },
          "interests": [
            "application-development"
          ],
          "semesters": [
            "Fall-2016",
            "Spring-2017"
          ],
          "moreInformation": "http://hi-seas.org",
          "independentStudy": true
        },
        {
          "name": "Solar Energy Analytics",
          "slug": "data-analytics-for-solar-energy",
          "description": "Integrating renewable energy to the power grid requires grid operators to balance energy generation with consumption. This project investigates the use of various data mining techniques to forecast solar irradiance using a variety of time-series data sources. We are looking for motivated students interested in data integration, fusion, mining and visualization.",
          "opportunityType": "MGzFhqnAx7HYcfuwj",
          "sponsor": "lipyeow",
          "ice": {
            "i": 25,
            "c": 0,
            "e": 25
          },
          "interests": [
            "application-development",
            "databases",
            "algorithms",
            "data-visualization",
            "data-science",
            "machine-learning"
          ],
          "semesters": [
            "Fall-2016",
            "Spring-2017",
            "Summer-2017"
          ],
          "moreInformation": "http://www2.hawaii.edu/~lipyeow/",
          "independentStudy": true
        },
        {
          "name": "Open Power Quality",
          "slug": "open-power-quality",
          "description": "The Open Power Quality project is designing custom hardware and software for low-cost, residential monitoring and cloud-based analysis of power quality. By better understanding power quality, we hope to enable more renewable energy in Hawaii and world-wide. We are looking for students who are interested in exploring circuit design, power quality algorithms, time series analysis, and/or web-based user interfaces.",
          "opportunityType": "MGzFhqnAx7HYcfuwj",
          "sponsor": "johnson",
          "ice": {
            "i": 25,
            "c": 0,
            "e": 25
          },
          "interests": [
            "application-development",
            "hardware",
            "data-visualization",
            "data-science"
          ],
          "semesters": [
            "Fall-2015",
            "Spring-2016",
            "Summer-2016",
            "Fall-2016",
            "Spring-2017",
            "Summer-2017"
          ],
          "moreInformation": "http://openpowerquality.org",
          "independentStudy": true
        },
        {
          "name": "Airline Security",
          "slug": "security-enhancement-of-commercial-airliner",
          "description": "Malicious controllers can possibly manipulate a flight control system e.g. aircraft or drones. from various channels, e.g. autonomic control devices, remote cyber controller, or human operators. Thus, pilots could suicide the aircraft, the auto-pilot might be infected by malware, and air traffic controllers can mishandle the drone. To better mitigate the potential risks, we hope to propose theoretical framework model in physical, human and cyber triad, a more secure air traffic control system, and a more safe task allocation mechanism. Students who are interested in aviation, risk control, and human-machine interface are highly encouraged to apply.",
          "opportunityType": "MGzFhqnAx7HYcfuwj",
          "sponsor": "depengli",
          "ice": {
            "i": 25,
            "c": 0,
            "e": 25
          },
          "interests": [
            "application-development",
            "security",
            "hci"
          ],
          "semesters": [
            "Fall-2015",
            "Spring-2016",
            "Summer-2016",
            "Fall-2016",
            "Spring-2017",
            "Summer-2017"
          ],
          "moreInformation": "http://www2.hawaii.edu/~depengli/index.html",
          "independentStudy": true
        },
        {
          "name": "AllNet",
          "slug": "allnet",
          "description": "My cellphone has a radio that could easily communicate with the radio in your cellphone. However, currently they do not, even when they are smartphones with wifi (802.11) capability. The AllNet project aims to allow personal devices to communicate directly with each other. We are looking for students who want to learn how to get different devices, both computers and cellphones/mobiles, to talk directly with each other. We are also interested in students who think they can adapt the current code to run as an app on their favorite mobile device.",
          "opportunityType": "MGzFhqnAx7HYcfuwj",
          "sponsor": "esb",
          "ice": {
            "i": 25,
            "c": 0,
            "e": 25
          },
          "interests": [
            "application-development",
            "networks",
            "mobile"
          ],
          "semesters": [
            "Fall-2015",
            "Spring-2016",
            "Summer-2016",
            "Fall-2016",
            "Spring-2017",
            "Summer-2017"
          ],
          "moreInformation": "http://alnt.org/",
          "independentStudy": true
        },
        {
          "name": "HI Capacity",
          "slug": "hicapacity",
          "description": "HI Capacity is a \"makerspace\" or \"hackerspace\": a community-operated physical place where people can meet and work on their projects. HI Capacity members are interested in hardware, software, art and the synergies between them. HI Capacity hosts social events, technical presentations, and soft skill workshops to support a vibrant technology sector in Hawaii while also trying to enrich other sectors with our skills in technology. We cater to all skill levels from hobbyist to student to senior professional.",
          "opportunityType": "TTC3fY6EySAQzSmS4",
          "sponsor": "johnson",
          "ice": {
            "i": 10,
            "c": 0,
            "e": 10
          },
          "interests": [
            "hardware",
            "entrepreneurship",
            "application-development"
          ],
          "semesters": [
            "Fall-2015",
            "Spring-2016",
            "Summer-2016",
            "Fall-2016",
            "Spring-2017",
            "Summer-2017"
          ],
          "moreInformation": "https://hicapacity.org/",
          "independentStudy": false
        },
        {
          "name": "ACM Manoa",
          "slug": "acm-manoa",
          "description": "The Association for Computing Machinery at Manoa is UH Manoa’s student chapter of the Association for Computing Machinery. We are a Registered Independent Organization (RIO) focused on providing opportunities and resources for our members’ personal and professional advancement.  ACM Manoa has 3 pillars - social, professional, and technical. We hold social activities for our members to have fun as well as develop and strengthen their interpersonal relationships. We strive to connect our members to professionals in the industry, abroad and within the Honolulu community. We are largely comprised of aspiring professionals in the computing industry; accordingly, members in ACM Manoa are encouraged to join and create Special Interest Groups (SIG) and Playgrounds where they can collaborate on interesting projects.",
          "opportunityType": "TTC3fY6EySAQzSmS4",
          "sponsor": "johnson",
          "ice": {
            "i": 10,
            "c": 0,
            "e": 10
          },
          "interests": [
            "hardware",
            "entrepreneurship",
            "application-development"
          ],
          "semesters": [
            "Fall-2015",
            "Spring-2016",
            "Summer-2016",
            "Fall-2016",
            "Spring-2017",
            "Summer-2017"
          ],
          "moreInformation": "http://acmanoa.github.io/",
          "independentStudy": false
        },
        {
          "name": "Business Plan Competition",
          "slug": "shidler-bpc",
          "description": "The annual Shidler Business Plan competition is an intense and unique semester-long learning opportunity for UH students who aspire to pursue a business venture. The competition provides mentorship, training and resources. Winners walk away with a wealth of business savvy and substantial cash prizes.",
          "opportunityType": "u5rr6JLxqPoj3SQvC",
          "sponsor": "johnson",
          "ice": {
            "i": 10,
            "c": 0,
            "e": 25
          },
          "interests": [
            "entrepreneurship"
          ],
          "semesters": [
            "Fall-2015",
            "Spring-2016",
            "Fall-2016",
            "Spring-2017"
          ],
          "moreInformation": "http://pace.shidler.hawaii.edu/bpc",
          "independentStudy": false
        },
        {
          "name": "Wetware Wednesday",
          "slug": "wetware-wednesday",
          "description": "WetWare Wednesday is dedicated to software developers in Hawaii who are interested in meeting monthly in a casual and friendly environment to share ideas, collaborate and spark new opportunities. Founded by HTDC and Blue Planet Software, the goal of WetWare Wednesday is to bring software developers, students and educators together to connect, network, discuss projects, review products, and collaborate in an effort to further the software development community. Venues and sponsors change monthly.",
          "opportunityType": "u5rr6JLxqPoj3SQvC",
          "sponsor": "johnson",
          "ice": {
            "i": 10,
            "c": 0,
            "e": 10
          },
          "interests": [
            "entrepreneurship"
          ],
          "semesters": [
            "Fall-2015",
            "Spring-2016",
            "Summer-2016",
            "Fall-2016",
            "Spring-2017",
            "Summer-2017",
            "Fall-2017",
            "Spring-2018",
            "Summer-2018",
            "Fall-2018",
            "Spring-2019",
            "Summer-2019"
          ],
          "moreInformation": "http://htdc.org/wetwarewed/",
          "independentStudy": false
        },
        {
          "name": "Career Fair",
          "slug": "uh-career-fair",
          "description": "The purpose of this career fair is to provide students with the “tools” and resources to make important and valuable career decisions. During the Career Fair, you will take your “first steps” toward meaningful employment by meeting with employers face to face to exchange information.",
          "opportunityType": "u5rr6JLxqPoj3SQvC",
          "sponsor": "glau",
          "ice": {
            "i": 0,
            "c": 0,
            "e": 10
          },
          "interests": [],
          "semesters": [
            "Fall-2016"
          ],
          "moreInformation": "http://manoa.hawaii.edu/careercenter/students/career-fair/",
          "independentStudy": false,
          "eventDate": "2016-10-11T00:00:00.000Z"
        },
        {
          "name": "AI XPRIZE",
          "slug": "ibm-watson-ai-xprize",
          "description": "The IBM Watson AI XPRIZE is a $5 million competition, challenging teams globally, to develop and demonstrate how humans can collaborate with powerful AI technologies to tackle the world’s grand challenges. The prize aims to accelerate adoption of AI technologies, and spark creative, innovative and audacious demonstrations of the technology that are truly scalable and solve societal grand challenges. To encourage innovation in any form, the competition is an open challenge in AI. Rather than set a single, universal goal for all teams, this competition will invite teams to each declare their own goal and solution to a grand challenge.\n\nThe IBM Watson AI XPRIZE is a four-year competition with annual milestone competitions in 2017, 2018, and 2019. The top three finalists will compete for the Grand Prize at TED 2020.",
          "opportunityType": "u5rr6JLxqPoj3SQvC",
          "sponsor": "glau",
          "ice": {
            "i": 20,
            "c": 0,
            "e": 20
          },
          "interests": [
            "artificial-intelligence",
            "application-development"
          ],
          "semesters": [
            "Summer-2016",
            "Fall-2016",
            "Spring-2017",
            "Summer-2017",
            "Fall-2017",
            "Spring-2018",
            "Summer-2018",
            "Fall-2018",
            "Spring-2019",
            "Summer-2019",
            "Fall-2019",
            "Spring-2020"
          ],
          "moreInformation": "http://developer.ibm.com/event/ibm-watson-ai-xprize/",
          "independentStudy": false
        },
        {
          "name": "AT&T Hackathon",
          "slug": "att-iot-hackathon",
          "description": "Do you like to design and make things? Are you inspired by the power of technology to build the world around you?\n\n    If so, we want to see you in action. The AT&T Developer Program and The Dallas Entrepreneur Center is inviting you to innovate and build what’s next in technology. We’re looking for creative thinkers like you to join us at this special IoT focused hackathon. All skill levels are welcome! We need a wide variety skills and perspectives to create positive change. There will be prizes around Smart Cities, Mechatronics and Women in Tech.",
          "opportunityType": "u5rr6JLxqPoj3SQvC",
          "sponsor": "glau",
          "ice": {
            "i": 15,
            "c": 0,
            "e": 15
          },
          "interests": [
            "artificial-intelligence",
            "application-development"
          ],
          "semesters": [
            "Fall-2016"
          ],
          "moreInformation": "http://developer.ibm.com/iotplatform/events/att-iot-hackathon-dallas/",
          "independentStudy": false,
          "eventDate": "2016-11-18T00:00:00.000Z"
        }
      ]
    },
    {
      "name": "OpportunityInstanceCollection",
      "contents": [
        {
          "semester": "Fall-2015",
          "opportunity": "wetware-wednesday",
          "verified": false,
          "student": "abi"
        },
        {
          "semester": "Spring-2016",
          "opportunity": "wetware-wednesday",
          "verified": false,
          "student": "abi"
        },
        {
          "semester": "Fall-2016",
          "opportunity": "open-power-quality",
          "verified": false,
          "student": "abi"
        },
        {
          "semester": "Spring-2017",
          "opportunity": "open-power-quality",
          "verified": false,
          "student": "abi"
        },
        {
          "semester": "Summer-2017",
          "opportunity": "open-power-quality",
          "verified": false,
          "student": "abi"
        },
        {
          "semester": "Summer-2017",
          "opportunity": "hicapacity",
          "verified": false,
          "student": "abi"
        },
        {
          "semester": "Summer-2018",
          "opportunity": "wetware-wednesday",
          "verified": false,
          "student": "abi"
        },
        {
          "semester": "Summer-2019",
          "opportunity": "ibm-watson-ai-xprize",
          "verified": false,
          "student": "abi"
        }
      ]
    },
    {
      "name": "OpportunityTypeCollection",
      "contents": [
        {
          "name": "Research",
          "slug": "research",
          "description": "A research project related to computer science."
        },
        {
          "name": "Club",
          "slug": "club",
          "description": "A student club or professional organization related to computer science."
        },
        {
          "name": "Internship",
          "slug": "internship",
          "description": "An internship related to computer science."
        },
        {
          "name": "Event",
          "slug": "event",
          "description": "An event related to computer science."
        }
      ]
    },
    {
      "name": "SemesterCollection",
      "contents": [
        {
          "term": "Fall",
          "year": 2014
        },
        {
          "term": "Spring",
          "year": 2015
        },
        {
          "term": "Summer",
          "year": 2015
        },
        {
          "term": "Fall",
          "year": 2015
        },
        {
          "term": "Spring",
          "year": 2016
        },
        {
          "term": "Summer",
          "year": 2016
        },
        {
          "term": "Fall",
          "year": 2016
        },
        {
          "term": "Spring",
          "year": 2017
        },
        {
          "term": "Summer",
          "year": 2017
        },
        {
          "term": "Fall",
          "year": 2017
        },
        {
          "term": "Spring",
          "year": 2018
        },
        {
          "term": "Summer",
          "year": 2018
        },
        {
          "term": "Fall",
          "year": 2018
        },
        {
          "term": "Spring",
          "year": 2019
        },
        {
          "term": "Summer",
          "year": 2019
        },
        {
          "term": "Fall",
          "year": 2019
        },
        {
          "term": "Spring",
          "year": 2020
        },
        {
          "term": "Summer",
          "year": 2020
        },
        {
          "term": "Fall",
          "year": 2012
        },
        {
          "term": "Summer",
          "year": 2012
        },
        {
          "term": "Spring",
          "year": 2012
        },
        {
          "term": "Fall",
          "year": 2011
        },
        {
          "term": "Spring",
          "year": 2011
        },
        {
          "term": "Summer",
          "year": 2010
        },
        {
          "term": "Spring",
          "year": 2013
        },
        {
          "term": "Summer",
          "year": 2013
        },
        {
          "term": "Fall",
          "year": 2010
        },
        {
          "term": "Summer",
          "year": 2011
        },
        {
          "term": "Fall",
          "year": 2009
        },
        {
          "term": "Spring",
          "year": 2010
        }
      ]
    },
    {
      "name": "SlugCollection",
      "contents": [
        {
          "name": "Fall-2014",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2015",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2015",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2015",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2016",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2016",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2016",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2017",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2017",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2017",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2018",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2018",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2018",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2019",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2019",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2019",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2020",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2020",
          "entityName": "Semester"
        },
        {
          "name": "cs-disciplines",
          "entityName": "InterestType"
        },
        {
          "name": "non-cs-disciplines",
          "entityName": "InterestType"
        },
        {
          "name": "technologies",
          "entityName": "InterestType"
        },
        {
          "name": "algorithms",
          "entityName": "Interest"
        },
        {
          "name": "application-development",
          "entityName": "Interest"
        },
        {
          "name": "artificial-intelligence",
          "entityName": "Interest"
        },
        {
          "name": "bioinformatics",
          "entityName": "Interest"
        },
        {
          "name": "computer-architecture",
          "entityName": "Interest"
        },
        {
          "name": "computer-graphics",
          "entityName": "Interest"
        },
        {
          "name": "computer-vision",
          "entityName": "Interest"
        },
        {
          "name": "cognitive-science",
          "entityName": "Interest"
        },
        {
          "name": "cryptography",
          "entityName": "Interest"
        },
        {
          "name": "databases",
          "entityName": "Interest"
        },
        {
          "name": "data-visualization",
          "entityName": "Interest"
        },
        {
          "name": "data-science",
          "entityName": "Interest"
        },
        {
          "name": "computer-ethics",
          "entityName": "Interest"
        },
        {
          "name": "entrepreneurship",
          "entityName": "Interest"
        },
        {
          "name": "game-design",
          "entityName": "Interest"
        },
        {
          "name": "graduate-school",
          "entityName": "Interest"
        },
        {
          "name": "hardware",
          "entityName": "Interest"
        },
        {
          "name": "hci",
          "entityName": "Interest"
        },
        {
          "name": "hpc",
          "entityName": "Interest"
        },
        {
          "name": "machine-learning",
          "entityName": "Interest"
        },
        {
          "name": "it-management",
          "entityName": "Interest"
        },
        {
          "name": "mobile",
          "entityName": "Interest"
        },
        {
          "name": "networks",
          "entityName": "Interest"
        },
        {
          "name": "operating-systems",
          "entityName": "Interest"
        },
        {
          "name": "parallel-programming",
          "entityName": "Interest"
        },
        {
          "name": "robotics",
          "entityName": "Interest"
        },
        {
          "name": "security",
          "entityName": "Interest"
        },
        {
          "name": "software-engineering",
          "entityName": "Interest"
        },
        {
          "name": "teaching",
          "entityName": "Interest"
        },
        {
          "name": "theory-of-computation",
          "entityName": "Interest"
        },
        {
          "name": "art",
          "entityName": "Interest"
        },
        {
          "name": "biology",
          "entityName": "Interest"
        },
        {
          "name": "psychology",
          "entityName": "Interest"
        },
        {
          "name": "android",
          "entityName": "Interest"
        },
        {
          "name": "assembler",
          "entityName": "Interest"
        },
        {
          "name": "c",
          "entityName": "Interest"
        },
        {
          "name": "cplusplus",
          "entityName": "Interest"
        },
        {
          "name": "java",
          "entityName": "Interest"
        },
        {
          "name": "javascript",
          "entityName": "Interest"
        },
        {
          "name": "lisp",
          "entityName": "Interest"
        },
        {
          "name": "linux",
          "entityName": "Interest"
        },
        {
          "name": "perl",
          "entityName": "Interest"
        },
        {
          "name": "prolog",
          "entityName": "Interest"
        },
        {
          "name": "python",
          "entityName": "Interest"
        },
        {
          "name": "r",
          "entityName": "Interest"
        },
        {
          "name": "ruby",
          "entityName": "Interest"
        },
        {
          "name": "sql",
          "entityName": "Interest"
        },
        {
          "name": "johnson",
          "entityName": "User"
        },
        {
          "name": "binsted",
          "entityName": "User"
        },
        {
          "name": "lipyeow",
          "entityName": "User"
        },
        {
          "name": "depengli",
          "entityName": "User"
        },
        {
          "name": "esb",
          "entityName": "User"
        },
        {
          "name": "cmoore",
          "entityName": "User"
        },
        {
          "name": "glau",
          "entityName": "User"
        },
        {
          "name": "bs-cs",
          "entityName": "DesiredDegree"
        },
        {
          "name": "bs-ce",
          "entityName": "DesiredDegree"
        },
        {
          "name": "ba-ics",
          "entityName": "DesiredDegree"
        },
        {
          "name": "database-administrator",
          "entityName": "CareerGoal"
        },
        {
          "name": "data-scientist",
          "entityName": "CareerGoal"
        },
        {
          "name": "information-security-analyst",
          "entityName": "CareerGoal"
        },
        {
          "name": "information-system-manager",
          "entityName": "CareerGoal"
        },
        {
          "name": "network-architect",
          "entityName": "CareerGoal"
        },
        {
          "name": "research-scientist",
          "entityName": "CareerGoal"
        },
        {
          "name": "software-developer",
          "entityName": "CareerGoal"
        },
        {
          "name": "system-administrator",
          "entityName": "CareerGoal"
        },
        {
          "name": "web-developer",
          "entityName": "CareerGoal"
        },
        {
          "name": "research",
          "entityName": "OpportunityType"
        },
        {
          "name": "club",
          "entityName": "OpportunityType"
        },
        {
          "name": "internship",
          "entityName": "OpportunityType"
        },
        {
          "name": "event",
          "entityName": "OpportunityType"
        },
        {
          "name": "apps-for-high-latency-communication",
          "entityName": "Opportunity"
        },
        {
          "name": "data-analytics-for-solar-energy",
          "entityName": "Opportunity"
        },
        {
          "name": "open-power-quality",
          "entityName": "Opportunity"
        },
        {
          "name": "security-enhancement-of-commercial-airliner",
          "entityName": "Opportunity"
        },
        {
          "name": "allnet",
          "entityName": "Opportunity"
        },
        {
          "name": "hicapacity",
          "entityName": "Opportunity"
        },
        {
          "name": "acm-manoa",
          "entityName": "Opportunity"
        },
        {
          "name": "shidler-bpc",
          "entityName": "Opportunity"
        },
        {
          "name": "wetware-wednesday",
          "entityName": "Opportunity"
        },
        {
          "name": "uh-career-fair",
          "entityName": "Opportunity"
        },
        {
          "name": "ibm-watson-ai-xprize",
          "entityName": "Opportunity"
        },
        {
          "name": "att-iot-hackathon",
          "entityName": "Opportunity"
        },
        {
          "name": "other",
          "entityName": "Course"
        },
        {
          "name": "ics101",
          "entityName": "Course"
        },
        {
          "name": "ics110",
          "entityName": "Course"
        },
        {
          "name": "ics111",
          "entityName": "Course"
        },
        {
          "name": "ics141",
          "entityName": "Course"
        },
        {
          "name": "ics211",
          "entityName": "Course"
        },
        {
          "name": "ics212",
          "entityName": "Course"
        },
        {
          "name": "ics215",
          "entityName": "Course"
        },
        {
          "name": "ics222",
          "entityName": "Course"
        },
        {
          "name": "ics241",
          "entityName": "Course"
        },
        {
          "name": "ics311",
          "entityName": "Course"
        },
        {
          "name": "ics314",
          "entityName": "Course"
        },
        {
          "name": "ics312",
          "entityName": "Course"
        },
        {
          "name": "ics313",
          "entityName": "Course"
        },
        {
          "name": "ics321",
          "entityName": "Course"
        },
        {
          "name": "ics331",
          "entityName": "Course"
        },
        {
          "name": "ics332",
          "entityName": "Course"
        },
        {
          "name": "ics351",
          "entityName": "Course"
        },
        {
          "name": "ics355",
          "entityName": "Course"
        },
        {
          "name": "ics361",
          "entityName": "Course"
        },
        {
          "name": "ics390",
          "entityName": "Course"
        },
        {
          "name": "ics414",
          "entityName": "Course"
        },
        {
          "name": "ics415",
          "entityName": "Course"
        },
        {
          "name": "ics419",
          "entityName": "Course"
        },
        {
          "name": "ics421",
          "entityName": "Course"
        },
        {
          "name": "ics422",
          "entityName": "Course"
        },
        {
          "name": "ics423",
          "entityName": "Course"
        },
        {
          "name": "ics424",
          "entityName": "Course"
        },
        {
          "name": "ics425",
          "entityName": "Course"
        },
        {
          "name": "ics426",
          "entityName": "Course"
        },
        {
          "name": "ics431",
          "entityName": "Course"
        },
        {
          "name": "ics432",
          "entityName": "Course"
        },
        {
          "name": "ics435",
          "entityName": "Course"
        },
        {
          "name": "ics441",
          "entityName": "Course"
        },
        {
          "name": "ics442",
          "entityName": "Course"
        },
        {
          "name": "ics443",
          "entityName": "Course"
        },
        {
          "name": "ics451",
          "entityName": "Course"
        },
        {
          "name": "ics452",
          "entityName": "Course"
        },
        {
          "name": "ics455",
          "entityName": "Course"
        },
        {
          "name": "ics461",
          "entityName": "Course"
        },
        {
          "name": "ics462",
          "entityName": "Course"
        },
        {
          "name": "ics464",
          "entityName": "Course"
        },
        {
          "name": "ics465",
          "entityName": "Course"
        },
        {
          "name": "ics466",
          "entityName": "Course"
        },
        {
          "name": "ics469",
          "entityName": "Course"
        },
        {
          "name": "ics471",
          "entityName": "Course"
        },
        {
          "name": "ics475",
          "entityName": "Course"
        },
        {
          "name": "ics476",
          "entityName": "Course"
        },
        {
          "name": "ics481",
          "entityName": "Course"
        },
        {
          "name": "ics483",
          "entityName": "Course"
        },
        {
          "name": "ics484",
          "entityName": "Course"
        },
        {
          "name": "ics485",
          "entityName": "Course"
        },
        {
          "name": "ics491",
          "entityName": "Course"
        },
        {
          "name": "ics495",
          "entityName": "Course"
        },
        {
          "name": "ics499",
          "entityName": "Course"
        },
        {
          "name": "iceInnovationPoints",
          "entityName": "Feedback"
        },
        {
          "name": "iceCompetencyPoints",
          "entityName": "Feedback"
        },
        {
          "name": "iceExperiencePoints",
          "entityName": "Feedback"
        },
        {
          "name": "updateStarData",
          "entityName": "Feedback"
        },
        {
          "name": "CourseRecommendationsBasedOnInterests",
          "entityName": "Feedback"
        },
        {
          "name": "requiredCourseMissing",
          "entityName": "Feedback"
        },
        {
          "name": "prerequisiteMissing",
          "entityName": "Feedback"
        },
        {
          "name": "semesterOverloaded",
          "entityName": "Feedback"
        },
        {
          "name": "courseNotOffered",
          "entityName": "Feedback"
        },
        {
          "name": "solar-energy-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "radgrad-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "acmanoa-webmaster-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "flip-flop-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "algorithm-visualization-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "grey-hats-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "open-power-quality-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "scientific-workflows-teaser",
          "entityName": "Teaser"
        },
        {
          "name": "abi",
          "entityName": "User"
        },
        {
          "name": "alfred",
          "entityName": "User"
        },
        {
          "name": "betty",
          "entityName": "User"
        },
        {
          "name": "Fall-2012",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2012",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2012",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2011",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2011",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2010",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2013",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2013",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2010",
          "entityName": "Semester"
        },
        {
          "name": "Summer-2011",
          "entityName": "Semester"
        },
        {
          "name": "Fall-2009",
          "entityName": "Semester"
        },
        {
          "name": "Spring-2010",
          "entityName": "Semester"
        },
        {
          "name": "charley",
          "entityName": "User"
        },
        {
          "name": "ella",
          "entityName": "User"
        },
        {
          "name": "feed-abi-new",
          "entityName": "Feed"
        },
        {
          "name": "radgrad",
          "entityName": "User"
        }
      ]
    },
    {
      "name": "TeaserCollection",
      "contents": [
        {
          "title": "Solar Energy",
          "slug": "solar-energy-teaser",
          "author": "Lipyeow Lim",
          "url": "https://youtube.com/embed/PAuOggtDYi0",
          "description": "Opportunity to gather and anaylze weather data for a solar energy project.",
          "duration": "0:17",
          "interests": [
            "data-science"
          ]
        },
        {
          "title": "RadGrad",
          "slug": "radgrad-teaser",
          "author": "Philip Johnson",
          "url": "https://youtube.com/embed/yea8MtK5CRk",
          "description": "Opportunity to join the RadGrad development team.",
          "duration": "0:24",
          "interests": [
            "software-engineering",
            "application-development",
            "javascript"
          ]
        },
        {
          "title": "ACManoa Webmaster",
          "slug": "acmanoa-webmaster-teaser",
          "author": "Torlief Nielson",
          "url": "https://youtube.com/embed/OI4CXULK3tw",
          "description": "Opportunity to learn about web development while developing the ACManoa website.",
          "duration": "1:25",
          "interests": [
            "application-development",
            "javascript"
          ]
        },
        {
          "title": "Flip Flop",
          "slug": "flip-flop-teaser",
          "author": "Jan Stelovsky",
          "url": "https://www.youtube.com/embed/V9gWxXOwilI",
          "description": "Opportunity to develop a new visual and interactive programming environment.",
          "duration": "0:39",
          "interests": [
            "data-visualization"
          ]
        },
        {
          "title": "Algorithm Visualization",
          "slug": "algorithm-visualization-teaser",
          "author": "Jan Stelovsky",
          "url": "https://www.youtube.com/embed/bMYRh1RQFF8",
          "description": "Opportunity to help develop interactive algorithm teaching software.",
          "duration": "1:12",
          "interests": [
            "algorithms",
            "teaching"
          ]
        },
        {
          "title": "Grey Hats",
          "slug": "grey-hats-teaser",
          "author": "Grey Hats",
          "url": "https://www.youtube.com/embed/oxFaOmsRIWQ",
          "description": "Join a club with other ICS students to learn about security.",
          "duration": "0:50",
          "interests": [
            "security"
          ]
        },
        {
          "title": "Open Power Quality",
          "slug": "open-power-quality-teaser",
          "author": "Sergey Negrashov",
          "url": "https://www.youtube.com/embed/ouq6Hsy7sDo",
          "description": "Help ease Oahus transition to a fully renewable power grid.",
          "duration": "0:21",
          "interests": [
            "software-engineering"
          ]
        },
        {
          "title": "Scientific Workflows",
          "slug": "scientific-workflows-teaser",
          "author": "Henri Casanova",
          "url": "https://www.youtube.com/embed/cRvLtv1_zGI",
          "description": "How to make scientific workflows compute fast on modern computer architectures using current HPC systems.",
          "duration": "2:17",
          "interests": [
            "algorithms",
            "hpc",
            "parallel-programming",
            "theory-of-computation"
          ]
        }
      ]
    },
    {
      "name": "UserCollection",
      "contents": [
        {
          "firstName": "Philip",
          "lastName": "Johnson",
          "slug": "johnson",
          "email": "johnson@hawaii.edu",
          "role": "FACULTY",
          "uhID": "8765-4321",
          "picture": "/images/mockup/johnson.jpg",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Kim",
          "lastName": "Binsted",
          "slug": "binsted",
          "email": "binsted@hawaii.edu",
          "role": "FACULTY",
          "uhID": "8765-4320",
          "picture": null,
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Lipyeow",
          "lastName": "Lim",
          "slug": "lipyeow",
          "email": "lipyeow@hawaii.edu",
          "role": "FACULTY",
          "uhID": "8765-4319",
          "picture": null,
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Depeng",
          "lastName": "Li",
          "slug": "depengli",
          "email": "depengli@hawaii.edu",
          "role": "FACULTY",
          "uhID": "8765-4318",
          "picture": null,
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Edo",
          "lastName": "Biagioni",
          "slug": "esb",
          "email": "esb@hawaii.edu",
          "role": "FACULTY",
          "uhID": "8765-4317",
          "picture": null,
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Cam",
          "lastName": "Moore",
          "slug": "cmoore",
          "email": "cmoore@hawaii.edu",
          "role": "ADVISOR",
          "uhID": "1017-6869",
          "picture": "/images/mockup/cmoore.jpg",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Gerald",
          "lastName": "Lau",
          "slug": "glau",
          "email": "glau@hawaii.edu",
          "role": "ADVISOR",
          "uhID": "8765-4315",
          "picture": "/images/mockup/glau.jpg",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Abigail",
          "lastName": "Kealoha",
          "slug": "abi",
          "email": "abi@hawaii.edu",
          "role": "STUDENT",
          "uhID": "1234-5678",
          "picture": "/images/mockup/abi.jpg",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Alfred",
          "lastName": "Persona",
          "slug": "alfred",
          "email": "alfred@hawaii.edu",
          "role": "STUDENT",
          "uhID": "1234-5679",
          "picture": "/images/mockup/alfred.png",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Betty",
          "lastName": "Keanu",
          "slug": "betty",
          "email": "betty@hawaii.edu",
          "role": "STUDENT",
          "uhID": "1234-5680",
          "picture": "/images/mockup/betty.jpg",
          "website": "http://keanu.github.io/",
          "interests": [
            "algorithms",
            "android"
          ],
          "careerGoals": [
            "data-scientist"
          ],
          "desiredDegree": "bs-cs",
          "level": 1
        },
        {
          "firstName": "Charley",
          "lastName": "Sherry",
          "slug": "charley",
          "email": "charley@hawaii.edu",
          "role": "STUDENT",
          "uhID": "1234-5681",
          "picture": "/images/mockup/charley.jpg",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Ella",
          "lastName": "Zwick",
          "slug": "ella",
          "email": "ella@hawaii.edu",
          "role": "STUDENT",
          "uhID": "1234-5682",
          "picture": "/images/mockup/ella.jpg",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        },
        {
          "firstName": "Admin",
          "lastName": "RadGrad",
          "slug": "radgrad",
          "email": "radgrad@hawaii.edu",
          "role": "ADMIN",
          "uhID": "1111-1111",
          "picture": "/images/mockup/radgrad.png",
          "website": null,
          "interests": [],
          "careerGoals": [],
          "desiredDegree": null,
          "level": 1
        }
      ]
    },
    {
      "name": "ValidUserAccountCollection",
      "contents": [
        {
          "username": "johnson"
        },
        {
          "username": "binsted"
        },
        {
          "username": "lipyeow"
        },
        {
          "username": "depengli"
        },
        {
          "username": "esb"
        },
        {
          "username": "cmoore"
        },
        {
          "username": "glau"
        },
        {
          "username": "abi"
        },
        {
          "username": "alfred"
        },
        {
          "username": "betty"
        },
        {
          "username": "charley"
        },
        {
          "username": "ella"
        },
        {
          "username": "radgrad"
        }
      ]
    },
    {
      "name": "VerificationRequestCollection",
      "contents": [
        {
          "student": "abi",
          "opportunityInstance": "mMnTHJAkhKCenosxC",
          "submittedOn": "2017-01-08T22:01:21.783Z",
          "status": "Open",
          "processed": []
        },
        {
          "student": "abi",
          "opportunityInstance": "TWmgtQjHYBiNbruF8",
          "submittedOn": "2017-01-08T22:01:21.906Z",
          "status": "Open",
          "processed": []
        },
        {
          "student": "abi",
          "opportunityInstance": "8jJE9JZ6dFC89CHcg",
          "submittedOn": "2017-01-08T22:01:21.929Z",
          "status": "Open",
          "processed": []
        },
        {
          "student": "abi",
          "opportunityInstance": "f6gKjPFkyoJz2jacD",
          "submittedOn": "2017-01-10T16:50:45.480Z",
          "status": "Open",
          "processed": []
        },
        {
          "student": "abi",
          "opportunityInstance": "f6gKjPFkyoJz2jacD",
          "submittedOn": "2017-01-10T16:50:45.491Z",
          "status": "Open",
          "processed": []
        }
      ]
    },
    {
      "name": "WorkInstanceCollection",
      "contents": []
    }
  ]
}